[
  {
    "page_number": 1,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Finishing Touches",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "finished_product_description": "A book about dollhouse finishing touches with step-by-step instructions for over 70 projects."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A small illustration of a dollhouse.",
        "A stack of miniature books.",
        "A stack of miniature book blocks.",
        "A miniature straw hat on a stack of miniature books.",
        "A miniature brass bell on top of the stack of books.",
        "A miniature chair.",
        "A miniature table with a decorative base.",
        "A miniature candle in a candlestick.",
        "A miniature decorative bird on a stand.",
        "A miniature potted plant with dark green leaves.",
        "A miniature decorative bowl with flowers.",
        "A miniature tool, possibly a poker.",
        "Two miniature candles in holders.",
        "A collection of miniature framed portraits, including one silhouette.",
        "A miniature woven basket filled with miniature logs."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 2,
    "extracted": {
      "page_type": "table_of_contents",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 3,
    "extracted": {
      "page_type": "introduction",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A string of colorful paper chain links forming a garland.",
        "A red Christmas stocking.",
        "A silhouette of a figure in a hat and coat, repeated three times vertically, attached to a bow.",
        "A straw hat with a red ribbon.",
        "A topiary bush in a pot.",
        "A wooden stand holding several walking sticks or canes.",
        "A small, light green wooden stool."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 4,
    "extracted": {
      "page_type": "introduction",
      "projects": [],
      "tools_reference": [
        {
          "name": "Inch",
          "use": "Millimetre conversion",
          "suitable_for": [
            "1/64",
            "1/32",
            "3/64",
            "1/16",
            "3/32",
            "1/8",
            "3/16",
            "1/4",
            "3/8",
            "1/2",
            "5/8",
            "3/4",
            "7/8",
            "1"
          ]
        },
        {
          "name": "Millimetre",
          "use": "Inch conversion",
          "suitable_for": [
            "0.4",
            "0.8",
            "1.2",
            "1.6",
            "2.4",
            "3.2",
            "4.8",
            "6.3",
            "9.5",
            "12.7",
            "15.9",
            "19.0",
            "22.0",
            "25.4"
          ]
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "A small, ornate, dark wood chair with a high back and simple arms, placed on a light-colored base.",
        "A small, potted green plant with long, thin leaves, sitting on a small, light-colored pedestal.",
        "A stack of three small, antique-looking books with brown covers and cream pages.",
        "Two small, brass-colored candles with white flames.",
        "A delicate, gold-colored decorative pin with a small, leaf-like ornament.",
        "A small, stuffed angel figure with pink wings and a halo, holding a wand with a star.",
        "Two small, decorative bowls filled with what appear to be miniature fruits or beads."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 5,
    "extracted": {
      "page_type": "materials_guide",
      "projects": [],
      "tools_reference": [
        {
          "name": "Drills",
          "use": "Mini electric drills are supplied with fine drill bits. They are more expensive than a hand-held pin vice but are quicker.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Mitre cutters",
          "use": "These are basically scissors for wood and will cut and mitre strip wood up to 1/2in thick. They are used as an alternative to a saw and mitre block.",
          "suitable_for": [
            "wood",
            "strip wood"
          ]
        },
        {
          "name": "Pin files",
          "use": "These have fine, shaped heads for intricate shaping and sanding.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Pin vice",
          "use": "A pin vice is used for drilling through wood and will hold extremely fine drill bits up to 1/8in diameter.",
          "suitable_for": [
            "wood",
            "drill bits"
          ]
        },
        {
          "name": "Right-angled gluing jig",
          "use": "A frame (easily made at home) with two fixed sides set at right angles which enables an object being glued to be held square.",
          "suitable_for": [
            "gluing"
          ]
        },
        {
          "name": "Sandpaper",
          "use": "Essential for shaping, smoothing and distressing wood. Use fine-grade sandpaper for projects at this scale.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Saw and mitre block",
          "use": "A junior hacksaw or razor saw are used with a small mitre block to cut and mitre strip wood. They are used as an alternative to mitre cutters and will also cut brass tube.",
          "suitable_for": [
            "wood",
            "strip wood",
            "brass tube"
          ]
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "Several pieces of wood are shown, labeled Bass wood, Jelutong wood, Obechi wood, and Wood dowel.",
        "A close-up of a saw and mitre block with a piece of wood being cut.",
        "A pair of orange-handled mitre cutters.",
        "A small metal pin vice with a fine point.",
        "A right-angled gluing jig made of wood.",
        "A piece of sandpaper."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 6,
    "extracted": {
      "page_type": "materials_guide",
      "projects": [],
      "tools_reference": [
        {
          "name": "3-D gloss varnish",
          "use": "Produces a raised, glossy finish when dry. Often used as a rubber-stamping accessory.",
          "suitable_for": []
        },
        {
          "name": "Metallic pastes",
          "use": "Wax-based pastes, also known as gilt creams, can be applied sparingly to a painted surface to give the appearance of age and depth. Metallic shoe polish can be used as an alternative.",
          "suitable_for": []
        },
        {
          "name": "Paints",
          "use": "Available in a wide range, either water-based or oil-based. Water-based acrylic paints are recommended for most projects as they are non-toxic and easy to work with. Glass and enamel paints are also available in acrylics. Several of the projects require oil-based spray paints.",
          "suitable_for": []
        },
        {
          "name": "Paintbrushes",
          "use": "Artist's paintbrushes are available in a range of sizes ideal for painting miniatures.",
          "suitable_for": []
        },
        {
          "name": "Shoe polish",
          "use": "Used as a wax-based wood stain and polish, combined.",
          "suitable_for": []
        },
        {
          "name": "Steel wool",
          "use": "Use fine-grade wire to apply shoe polish to wood.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Superglue gel",
          "use": "This strong glue is useful as it bonds instantly.",
          "suitable_for": []
        },
        {
          "name": "Tacky glue",
          "use": "This non-toxic water-based glue dries clear, strong and flexible. It is particularly suited to wood, paper, card and fabric. Thick or mighty tacky glue is recommended for best results.",
          "suitable_for": [
            "wood",
            "paper",
            "card",
            "fabric"
          ]
        },
        {
          "name": "Wood stain",
          "use": "A water-based or oil-based colouring applied to wood with a soft cloth. Use water-based wood stains to achieve distressed paint effects.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Scissors",
          "use": "Small sharp scissors are essential for cutting paper and templates.",
          "suitable_for": [
            "paper",
            "templates"
          ]
        },
        {
          "name": "Paper punches",
          "use": "Several of the projects use paper punches, available in a wide variety of shapes and sizes for the craft worker.",
          "suitable_for": [
            "paper"
          ]
        },
        {
          "name": "Pliers",
          "use": "A useful tool for holding, cutting and bending wire.",
          "suitable_for": [
            "wire"
          ]
        },
        {
          "name": "Quilling tool",
          "use": "A small, hand-held tool used to coil quilling paper.",
          "suitable_for": [
            "quilling paper"
          ]
        },
        {
          "name": "Wire cutters",
          "use": "A tool used specifically to cut wire.",
          "suitable_for": [
            "wire"
          ]
        },
        {
          "name": "Craft knife",
          "use": "An essential tool for cutting wood and card. Model-maker's knives with replaceable blades are preferable to Stanley knives. Always use with a cutting mat and steel ruler.",
          "suitable_for": [
            "wood",
            "card"
          ]
        },
        {
          "name": "Cutting mat",
          "use": "This is a must when cutting with a craft knife, to protect working surfaces.",
          "suitable_for": []
        },
        {
          "name": "Ruler",
          "use": "A 12in steel ruler graduated in 1/16in is an essential basic tool.",
          "suitable_for": []
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "Image shows various bottles and containers of colouring mediums, glues, and varnishes including: a small bottle labeled 'Paint', a spray can labeled 'Spray paint', a bottle labeled 'Tacky glue', a tall metal tin labeled 'Wood stain', a bottle labeled '3-D gloss varnish', a small bottle of yellow liquid, a tube labeled 'Superglue gel', a tube labeled 'Metallic paste', a round tin of 'Shoe polish', a paintbrush, a ball of 'Steel wool', and a bottle labeled 'Paint'.",
        "Image shows a pair of scissors labeled 'Scissors'.",
        "Image shows a pair of pliers labeled 'Pliers'.",
        "Image shows a metal ruler labeled 'Metal ruler'.",
        "Image shows a green cutting mat labeled 'Cutting mat'.",
        "Image shows a craft knife labeled 'Craft knife'.",
        "Image shows a blue paper punch with a star shape labeled 'Paper punches'.",
        "Image shows a quilling tool labeled 'Quilling tool'.",
        "Image shows a pair of wire cutters labeled 'Wire cutters'."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 7,
    "extracted": {
      "page_type": "materials_guide",
      "tools_reference": [
        {
          "name": "Beads",
          "use": "A variety of beads are used in the projects. Specific details of the beads required are given for each project.",
          "suitable_for": []
        },
        {
          "name": "Belaying pins",
          "use": "A model ship-building component available in wood in various sizes from model shops.",
          "suitable_for": []
        },
        {
          "name": "Brass pins",
          "use": "Available in various sizes from miniature hardware specialists.",
          "suitable_for": []
        },
        {
          "name": "Brass sheet",
          "use": "Available from model shops. A cheaper alternative is the inside of a tomato purée tube.",
          "suitable_for": []
        },
        {
          "name": "Brass tube",
          "use": "A hollow tube available in a range of diameters from model shops and cut using a mitre block and junior hacksaw.",
          "suitable_for": []
        },
        {
          "name": "Bunka",
          "use": "Perhaps better known as lampshade fringing, this can be purchased either as fringing or tassels from haberdashery (notions) stores.",
          "suitable_for": []
        },
        {
          "name": "Canvas",
          "use": "Two types of needlework canvas are used in some projects - tapestry canvas and suit interlining canvas.",
          "suitable_for": []
        },
        {
          "name": "Centre cane",
          "use": "Used in basket making and available from specialist outlets in various thicknesses. It is known as round reed cane in the USA.",
          "suitable_for": []
        },
        {
          "name": "Clear plastic tube",
          "use": "Often used to cover the bristles on new artist's paintbrushes.",
          "suitable_for": []
        },
        {
          "name": "Cocktail sticks",
          "use": "A substitute for 1/16in hardwood dowel.",
          "suitable_for": []
        },
        {
          "name": "Cold porcelain",
          "use": "A non-toxic modelling material made from a mixture of PVA glue, cornflour and a preservative. It is most often used for cake decoration.",
          "suitable_for": []
        },
        {
          "name": "Double column",
          "use": "Model ship-building component, available in wood from most good model shops.",
          "suitable_for": []
        },
        {
          "name": "Eyelets",
          "use": "These are measured by the narrow opening at the top of the eyelet. Straight-ended ones are used in the projects rather than serrated ones.",
          "suitable_for": []
        },
        {
          "name": "Filigrees and findings",
          "use": "Metal egg-decorating components, including scrolls, spokes, frames, decorative caps and up-eyes have been used in some projects.",
          "suitable_for": []
        },
        {
          "name": "Floral tape",
          "use": "This is normally used to bind flowers and leaves together in cake decoration.",
          "suitable_for": []
        },
        {
          "name": "Flower shades",
          "use": "Plastic flower shades from egg decorating or jewellery suppliers.",
          "suitable_for": []
        },
        {
          "name": "Jewellery findings",
          "use": "These are metal jewellery-making components, including head pins, bead caps and pendant frames.",
          "suitable_for": []
        },
        {
          "name": "Paper balls",
          "use": "Compact-shaped paper balls used in various crafts.",
          "suitable_for": []
        },
        {
          "name": "Stamens",
          "use": null,
          "suitable_for": []
        },
        {
          "name": "Waxed thread",
          "use": null,
          "suitable_for": []
        }
      ],
      "diagram_descriptions": [
        "A collection of craft materials including brass sheet, brass tube, scenic scatter (green flocking), bunka (lampshade fringing), belaying pins, beads, paper balls, brass pins, cocktail sticks, stamens, cold porcelain, and waxed thread.",
        "Close-up of brass sheet with a decorative edge.",
        "A close-up of a brass tube.",
        "A pile of green flocking material labeled 'Scenic scatter'.",
        "A spool of gold-colored thread or cord labeled 'Bunka (lampshade fringing)'.",
        "Several small wooden pieces labeled 'Belaying pins'.",
        "A collection of various beads, including a red cube bead, a ribbed gold bead, and several round beads.",
        "A small pile of small brass pins.",
        "Several small wooden sticks labeled 'Cocktail sticks'.",
        "A bundle of white and pink stamens.",
        "A white, smooth ball of material labeled 'Cold porcelain'.",
        "A large coil of dark green thread labeled 'Waxed thread'."
      ]
    }
  },
  {
    "page_number": 8,
    "extracted": {
      "page_type": "materials_guide",
      "projects": [],
      "tools_reference": [
        {
          "name": "Stamens",
          "use": "Used in the centre of a flower in cake decorating.",
          "suitable_for": [
            "cake decorating"
          ]
        },
        {
          "name": "Water-slide transfers (decals)",
          "use": "Used to decorate a wide range of items. Separate the transfer from the paper backing by soaking in water for several minutes. Miniature transfers are often used in egg decorating.",
          "suitable_for": [
            "decorating",
            "egg decorating"
          ]
        },
        {
          "name": "Wire",
          "use": "Jewellery-making wire and florist's stub wire are available in various gauges. Some projects use paper-covered wire, which is commonly used in cake decoration.",
          "suitable_for": [
            "jewellery making",
            "cake decoration"
          ]
        },
        {
          "name": "Waxed thread",
          "use": "A thread treated with wax, often used in jewellery making.",
          "suitable_for": [
            "jewellery making"
          ]
        },
        {
          "name": "Filigrees",
          "use": "Decorative metal elements.",
          "suitable_for": [
            "crafts"
          ]
        },
        {
          "name": "Eyelets",
          "use": "Small metal rings used for reinforcement or decoration.",
          "suitable_for": [
            "crafts"
          ]
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "A collection of craft materials including: flower shades (represented by wisps of colored paper), paper ribbon (a wide, creased blue ribbon), quilling paper (thin strips of colored paper), jewellery findings (a small metal filigree, a pendant, and a jump ring), ribbon (a small yellow filigree and a larger filigree), water-slide transfers (two small floral decals), eyelets (two small metal eyelets), centre cane (round reed cane) (a coil of thin, light brown cane), wire (a coil of thin, gold-colored wire), floral tape (a roll of dark brown floral tape), canvas (a textured fabric sample), and pastel paper (sheets of pastel colored paper). A package of FIMO modeling clay is also shown.",
        "A close-up of a roll of floral tape.",
        "A close-up of a package of FIMO modeling clay with instructions in English and French.",
        "A close-up of several sheets of pastel colored paper.",
        "A close-up of a coil of gold-colored wire.",
        "A close-up of a collection of jewellery findings including filigrees and a pendant.",
        "A close-up of quilling paper strips in various colors.",
        "A close-up of a wide, creased blue paper ribbon.",
        "A close-up of two floral water-slide transfers and two eyelets.",
        "A close-up of two filigree embellishments."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 9,
    "extracted": {
      "page_type": "tools_reference",
      "projects": [],
      "tools_reference": [
        {
          "name": "Colouring Mediums",
          "use": "Projects use various colouring mediums, including water-based acrylic paints, shoe polish and wood stain.",
          "suitable_for": [
            "water-based acrylic paints",
            "shoe polish",
            "wood stain"
          ]
        },
        {
          "name": "Paints",
          "use": "Apply acrylic water-based paints with an artist's paintbrush: medium (approx. size 6) and fine (approx. size 000) are needed for some projects. Several of the projects use oil-based spray or enamel paints; follow the manufacturer's safety instructions when using these products.",
          "suitable_for": [
            "acrylic water-based paints",
            "oil-based spray paints",
            "enamel paints"
          ]
        },
        {
          "name": "Shoe polish",
          "use": "Apply shoe polish to wood using fine-gauge wire wool and buff up to a sheen with clean wire wool or a cloth. Avoid using polish on edges to be glued, as the bond will not be as strong.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Wood stain",
          "use": "Apply wood stain to wood using a soft cloth and use sparingly as too much can warp the wood. Stain parts before assembly, allowing them to dry completely.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Distressing Techniques",
          "use": "A distressing technique is used to imitate age and wear and tear to a surface. Wood in particular responds well to such treatments. Make up the project following the instructions and paint with water-based acrylic paint. Sand the item in places where natural wear and tear would occur, to reveal the wood. Cover the whole article with a light water-based wood stain such as antique pine or medium oak. Remove the stain from the wood in accessible areas with a damp cloth. The stain will settle in the cracks and colour the bare wood, mimicking worn paint and grime. Use water-based wood stain and shoe polish sparingly to achieve aged finishes on other materials, such as paper, card and fabric.",
          "suitable_for": [
            "wood",
            "paper",
            "card",
            "fabric"
          ]
        },
        {
          "name": "Cutting Wood",
          "use": "Use a craft knife, mitre cutters or a saw to cut wood, cutting so the grain runs in line with the sides that have the longest measurement. Sand and polish wood following the grain.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Chamfering",
          "use": "This means creating an angle at the edge of the piece of wood. Hold the piece of wood upright (at a slight angle) above fine-grade sandpaper, with the edge to be chamfered facing down. Sand the edge in small sweeping motions in the same direction, until you achieve the correct angle. Two angles, 45 and 60 degrees, are drawn here.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Mitring",
          "use": "This means cutting the ends of two wood pieces to an angle of 45 degrees so they can be fitted together to make a right-angled joint. Use a mitre block and razor saw, positioning the saw in the slits of the mitre block to cut diagonally through the wood. Press the wood against the guide of the mitre cutters to achieve a 45-degree angle cut.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Framing",
          "use": "Mitring the ends of four strips of wood and then joining them together makes a frame. Each pair of pieces should be the same length. Position the corresponding size lengths opposite each other in a right-angled gluing jig (see page 8) and glue together. When mitring picture frame moulding, make sure the recess on the back of the wood runs with the shortest length of mitred wood strip.",
          "suitable_for": [
            "wood"
          ]
        },
        {
          "name": "Using Templates",
          "use": "Some of the projects have templates for you to use and these can be found on pages 61-62. Black and white templates should be photocopied for accuracy, although they may be traced with pencil and tracing paper if preferred. Colour templates should be reproduced either by colour photocopying on to white paper or card or by scanning the image into a computer and then printing on photo-quality card or paper.",
          "suitable_for": [
            "templates"
          ]
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "Diagram showing a mitre block and saw cutting a piece of wood at an angle.",
        "Diagram showing two angles for chamfering wood: 60 degrees and 45 degrees.",
        "Diagram showing two pieces of wood, one labelled 'Mitre' and the other labelled 'Chamfer'.",
        "Diagram showing a picture frame made with mitred wood strips.",
        "Diagram showing a mitre block with a piece of wood positioned for cutting."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 10,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A diorama scene depicting a medieval or Tudor-era setting. It features a dark wooden paneled wall as the backdrop. In the foreground, there is a rustic wooden throne-like chair, a small wooden stool with a dark mug on it, a tall candelabra with a white candle, and a polearm leaning against the wall. A large, broad-bladed axe is also leaning against the wall, positioned above the candle. The overall impression is one of historical or fantasy-themed miniature crafting."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 11,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Wooden Stool",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Obecchi sheet wood",
              "quantity": "1 piece",
              "dimensions": "3/32in thick",
              "notes": "for seat"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1 piece",
              "dimensions": "11/2in x 1in",
              "notes": "for seat"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "two",
              "dimensions": "11/8in lengths",
              "notes": "for long seat supports"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "two",
              "dimensions": "5/8in lengths",
              "notes": "for short seat supports"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "four",
              "dimensions": "13/8in lengths",
              "notes": "for legs"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "two",
              "dimensions": "11/8in lengths",
              "notes": "for long leg supports"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "two",
              "dimensions": "5/8in lengths",
              "notes": "for short leg supports"
            },
            {
              "item": "Oak-coloured shoe polish",
              "quantity": "1",
              "notes": "for finishing"
            },
            {
              "item": "Steel wool",
              "quantity": "1",
              "notes": "for finishing"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "notes": "for assembly"
            }
          ],
          "tools": [
            {
              "name": "Sandpaper",
              "purpose": "sanding components",
              "optional": false,
              "notes": "fine-grade"
            },
            {
              "name": "Steel wool",
              "purpose": "applying shoe polish",
              "optional": false
            },
            {
              "name": "Gluing jig",
              "purpose": "holding pieces while gluing",
              "optional": false,
              "notes": "see page 8"
            },
            {
              "name": "Craft knife",
              "purpose": "cleaning drilled section",
              "optional": false
            },
            {
              "name": "Drill",
              "purpose": "making holes for finger hole",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Sand each of the wooden components using fine-grade sandpaper. Use steel wool to apply an oak-coloured shoe polish to colour and polish each of the wood pieces.",
              "technique": "sanding, polishing",
              "visual_description": "Image shows all the individual wooden pieces for the stool laid out flat, some are rectangular planks, others are smaller strips and blocks."
            },
            {
              "step_number": 2,
              "instruction": "Place two legs, a short seat support and a short leg support (positioned 1/16in from the end of each leg) in a right-angled gluing jig (see page 8) and glue together. Repeat the procedure with the remaining two legs and short supports.",
              "technique": "gluing",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "Image shows two legs and two short supports being glued together in a right-angled jig, forming an 'H' shape."
            },
            {
              "step_number": 3,
              "instruction": "Once dry, take the leg constructions and place sideways in the gluing jig. Position and glue a long seat support and long leg support in between the leg structures and in line with the other supports. Repeat the procedure with the remaining wood pieces.",
              "technique": "gluing",
              "visual_description": "Image shows the two previously assembled leg structures being connected by long seat supports and long leg supports, forming the frame of the stool."
            },
            {
              "step_number": 4,
              "instruction": "Position and glue the frame centrally on to the underside of the seat. If you wish achieve the appearance of age and dirt on the polished surface, rub a small amount of black shoe polish into some areas and buff with wire wool.",
              "technique": "gluing, finishing",
              "visual_description": "Image shows the assembled stool frame being glued to the underside of the seat piece. The stool is shown from a top-down perspective."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "See Basic Techniques page 12 for more information on sanding and polishing."
          ],
          "finished_product_description": "A miniature wooden stool with a rustic finish."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A small, rustic wooden stool with four legs and a rectangular seat.",
        "Diagram showing the individual wooden components for the stool laid out flat.",
        "Diagram showing two legs and two short supports being glued together in a right-angled jig.",
        "Diagram showing the assembled stool frame being connected by long seat supports and long leg supports.",
        "Diagram showing the stool frame being glued to the underside of the seat.",
        "A variation of the wooden stool, painted green, with a pierced finger hole in the seat."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 12,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Torchère",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "brass tube",
              "quantity": "1",
              "dimensions": "3/16in diameter, 3 1/2in length",
              "color": "brass"
            },
            {
              "item": "aluminium dinner plate",
              "quantity": "1",
              "dimensions": "9/16in",
              "color": "aluminium"
            },
            {
              "item": "gold-plated head pin",
              "quantity": "1",
              "dimensions": "1in length",
              "color": "gold-plated"
            },
            {
              "item": "gold-plated scrolls",
              "quantity": "3",
              "dimensions": "3/4in long",
              "color": "gold-plated"
            },
            {
              "item": "white cake candle",
              "quantity": "1",
              "dimensions": null,
              "color": "white"
            },
            {
              "item": "pewter enamel spray paint",
              "quantity": "1 can",
              "dimensions": null,
              "color": "pewter"
            },
            {
              "item": "superglue gel",
              "quantity": "1 tube",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "drill",
              "purpose": "to drill a hole",
              "optional": false
            },
            {
              "name": "superglue",
              "purpose": "to secure the head pin",
              "optional": false
            },
            {
              "name": "soldering iron",
              "purpose": "to secure scrolls (alternative)",
              "optional": true
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Place the aluminium plate upside-down and drill a hole centrally through the middle using a 3/64in drill bit. Cut the head end off the gold-plated head pin so it measures 1/8in. Keep the opposite end as this is used to make the prickett.",
              "technique": "drilling, cutting",
              "dimensions_mentioned": [
                "3/64in",
                "1/8in"
              ],
              "visual_description": "Image shows a circular aluminium plate with a hole in the center, and a gold-plated pin cut to size."
            },
            {
              "step_number": 2,
              "instruction": "Use superglue gel to secure the head pin into one end of the brass tube and the straight end of the pin (the prickett) into the opposite end. The prickett should protrude by 3/8in. Glue the scrolls on to the end of the brass tube, allowing each one to dry before gluing the next. (Alternatively, solder the scrolls on for a stronger join.) Put the plate through the spike to rest on top of the tube and glue into place. Once dry, spray the torchère with pewter enamel spray paint.",
              "technique": "gluing, soldering (optional), spraying",
              "dimensions_mentioned": [
                "3/8in"
              ],
              "visual_description": "Image shows the brass tube with the head pin and prickett inserted, and scrolls being glued on. Another image shows the plate attached to the top of the tube."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Cut and prepare a white cake candle (see step 2, page 37) to 1/2in long and insert on to the prickett."
          ],
          "finished_product_description": "A floor-standing torchère with a candle holder."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image showing the components for the torchère: two circular plates, one with a hole, and two gold-plated pins of different lengths.",
        "Image showing the assembled torchère with a candle on top.",
        "Image showing a close-up of the base of the torchère with decorative scrolls.",
        "Image showing a smaller version of the torchère."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 13,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Fighting Axe",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Thin card for black and white photocopying",
              "quantity": "1 piece",
              "dimensions": null,
              "color": "black and white"
            },
            {
              "item": "Hardwood dowel",
              "quantity": "1 piece",
              "dimensions": "3/32in diameter, 3 1/2in length",
              "color": null
            },
            {
              "item": "Dark brown and black shoe polish",
              "quantity": "1 set",
              "dimensions": null,
              "color": "dark brown and black"
            },
            {
              "item": "Steel wool",
              "quantity": "1 piece",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Silver and black water-based acrylic paints",
              "quantity": "1 set",
              "dimensions": null,
              "color": "silver and black"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "Small, sharp scissors",
              "purpose": "cutting out template",
              "optional": false
            },
            {
              "name": "Craft knife",
              "purpose": "scoring line",
              "optional": false
            },
            {
              "name": "Ruler",
              "purpose": "scoring line",
              "optional": false
            },
            {
              "name": "Small paintbrush",
              "purpose": "applying paint",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Photocopy the axe template on page 62 on to thin card and use small, sharp scissors to cut around the outline. Use a craft knife and a ruler to score along the line between the two 'blades'. Fold the card so the scored line is on the inside.",
              "technique": "photocopying, cutting, scoring, folding",
              "dimensions_mentioned": [],
              "visual_description": "Two axe head shapes cut from card, one folded along a central score line."
            },
            {
              "step_number": 2,
              "instruction": "To make the shaft, take the hardwood dowel and use steel wool to apply a dark brown shoe polish, followed by black shoe polish to colour and polish the wood (see Basic Techniques page 12).",
              "technique": "polishing, colouring",
              "dimensions_mentioned": [],
              "visual_description": "Three wooden dowels, one of which is darker and appears polished."
            },
            {
              "step_number": 3,
              "instruction": "Position and glue the end of the shaft inside the shaped card as shown. Rub tacky glue over the inside of one of the card blades and press the other into place on top. If the blades are not exactly equal, trim to match once dry.",
              "technique": "gluing, trimming",
              "dimensions_mentioned": [],
              "visual_description": "Two card axe head shapes being glued together around the end of a wooden dowel shaft."
            },
            {
              "step_number": 4,
              "instruction": "Mix a small amount of black and silver water-based acrylic paints to make a dark silver colour. Apply a thin layer of paint to the axe head using a small paintbrush. Repeat the procedure until totally covered.",
              "technique": "mixing paint, painting",
              "dimensions_mentioned": [],
              "visual_description": "A finished axe head, painted dark silver, attached to a wooden shaft."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A model fighting axe made from card and a wooden dowel, painted to resemble metal."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Axe template",
          "scale": null,
          "shape_description": "Template for an axe head, consisting of two symmetrical blade shapes joined at the base, with a central score line indicated."
        },
        {
          "name": "Spearhead template",
          "scale": null,
          "shape_description": "Template for a spearhead."
        }
      ],
      "diagram_descriptions": [
        "Illustration of a finished fighting axe with a curved blade and a long wooden shaft.",
        "Diagram showing the two parts of the axe head template before assembly.",
        "Diagram showing three wooden dowels, representing the axe shaft, with one showing the polished finish.",
        "Diagram showing the axe head being assembled around the shaft.",
        "Diagram of the finished axe head, painted dark silver."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 14,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Leather Bucket",
          "category": "leather",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Black leather",
              "quantity": "1 piece",
              "dimensions": "about 1/16in thick",
              "color": "black"
            },
            {
              "item": "White paper",
              "quantity": "1 piece",
              "purpose": "for black and white photocopying",
              "color": "white"
            },
            {
              "item": "Darning needle",
              "quantity": "1"
            },
            {
              "item": "Medium-grade sandpaper",
              "quantity": "1 piece"
            },
            {
              "item": "24-gauge paper-covered wire",
              "quantity": "1 piece",
              "dimensions": "3 1/2in length"
            },
            {
              "item": "Black acrylic paint",
              "quantity": "1 bottle"
            },
            {
              "item": "Black and dark brown shoe polish",
              "quantity": "1 tin"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            }
          ],
          "tools": [
            {
              "name": "Craft knife",
              "purpose": "to remove thin slivers",
              "optional": false
            },
            {
              "name": "Sharp scissors",
              "purpose": "to cut leather",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Photocopy and cut out the two leather bucket templates on page 61. Place the templates on the underside of the leather and cut to shape using sharp scissors. Use a darning needle to pierce through the leather where indicated on the larger template.",
              "visual_description": "A diagram showing two curved shapes and one circular shape, representing the templates for the bucket body and base."
            },
            {
              "step_number": 2,
              "instruction": "Take the body of the bucket and use a craft knife to remove thin slivers on the underside of the leather at one end, approximately 1/16in wide. Turn the leather over and repeat the procedure on the top side of the leather at the other end.",
              "visual_description": "A diagram showing a curved piece of black leather with a thin sliver being removed from the edge with a craft knife."
            },
            {
              "step_number": 3,
              "instruction": "Rub sandpaper over the leather pieces to remove the shine. Rub a small amount of black and brown shoe polish around the edges and over each side to age, but do not buff. Paint the paper-covered wire black and when dry rub over with black shoe polish.",
              "visual_description": "A diagram showing the curved leather piece and the circular base piece, both appearing aged and slightly textured."
            },
            {
              "step_number": 4,
              "instruction": "Glue the two side edges of the bucket together, so the top of the leather overlaps the underside. Once dry, position and glue the circular base inside the bucket. Poke each end of the wire through the outside holes, forming a loop at each end.",
              "visual_description": "A diagram showing a finished leather bucket with a handle."
            }
          ],
          "finished_product_description": "A small, dark-colored bucket made of leather, with a wire handle.",
          "variation": {
            "name": "Leather Mug",
            "instructions": "Make a mug using the same instructions and the three mug templates on page 61. Remove thin slivers of leather on the underside of the handle at each end and then position and glue the handle on to the outside of the mug.",
            "visual_description": "A small, dark-colored mug made of leather."
          }
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Leather Bucket Templates",
          "description": "Two curved shapes for the bucket body and one circular shape for the base. The larger curved shape has two small holes indicated for the handle attachment."
        }
      ],
      "diagram_descriptions": [
        "A finished leather bucket with a wire handle.",
        "A diagram showing the templates for the bucket body and base.",
        "A diagram showing a curved piece of black leather with a thin sliver being removed from the edge with a craft knife.",
        "A diagram showing the curved leather piece and the circular base piece, both appearing aged and slightly textured.",
        "A small, dark-colored mug made of leather."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 15,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Box-seat Settle",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Obecchi sheet wood",
              "quantity": "1/8in thick",
              "dimensions": "1 5/8in x 1 1/4in",
              "purpose": "base"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "3/32in thick",
              "dimensions": "two 1 3/8in x 1/4in",
              "purpose": "arm rests"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "4in x 1 5/8in",
              "purpose": "seat back"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "two 2 5/8in x 1 1/8in",
              "purpose": "sides"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "1 5/8in x 1 3/8in",
              "purpose": "front (grain to run with shortest length)"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "1 5/8in x 1 3/8in",
              "purpose": "seat"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "3/16in x 3/16in",
              "dimensions": "two 4in lengths",
              "purpose": "back posts"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "3/16in x 3/16in",
              "dimensions": "two 2 5/8in lengths",
              "purpose": "front posts"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/4in x 1/16in",
              "dimensions": "five 1 5/8in lengths",
              "purpose": "horizontal back and front panels"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/4in x 1/16in",
              "dimensions": "six 1 1/8in",
              "purpose": "side panels"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/4in x 1/16in",
              "dimensions": "7/8in",
              "purpose": "vertical front panel"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/4in x 1/16in",
              "dimensions": "1 1/4in length",
              "purpose": "vertical back panel"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/8in x 1/16in",
              "dimensions": "two 1 1/8in",
              "purpose": "seat supports"
            },
            {
              "item": "Wooden doorknobs",
              "quantity": "Two 3/16in diameter"
            },
            {
              "item": "Oak-coloured shoe polish"
            },
            {
              "item": "Tacky glue"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the two pieces of wood for the arm rests and place together. Use sandpaper to shape the pieces as shown on the template on page 62. Sand and colour all of the wood components using oak-coloured shoe polish (see Basic Techniques page 12).",
              "technique": "shaping, sanding, colouring",
              "dimensions_mentioned": [],
              "visual_description": "Four small, rectangular pieces of wood, two slightly longer than the others, with visible grain texture."
            },
            {
              "step_number": 2,
              "instruction": "Take the seat back wood piece and the two back posts and glue the posts on to each side edge of the sheet wood. The underside of the seat back and the posts should be flush with each other.",
              "dimensions_mentioned": [],
              "visual_description": "A rectangular piece of wood with two smaller rectangular pieces attached vertically to its side edges, forming a U-shape."
            },
            {
              "step_number": 3,
              "instruction": "Take a horizontal back panel and position at the top of the construction, so the panel edge is flush with the top edge of the seat back. (Note, remaining back panels are positioned once the settle has been constructed.)",
              "dimensions_mentioned": [],
              "visual_description": "A rectangular piece of wood positioned horizontally across the top of the structure created in step 2."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A miniature box-seat settle, a type of bench with a storage area under a sliding seat panel, resembling Tudor-era furniture."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Arm Rests Template",
          "scale": null,
          "shape_description": "Template for shaping arm rest pieces."
        }
      ],
      "diagram_descriptions": [
        "A detailed, dark brown wooden miniature of a box-seat settle, showing the front with a raised seat and panelled back.",
        "A close-up of the wooden components for the arm rests, showing four pieces of light-coloured wood with visible grain.",
        "A close-up of a finished horizontal panel, likely for the back or front of the settle, showing a wood grain texture and a darker, aged finish.",
        "A close-up of another finished horizontal panel, similar to the previous one, possibly for the seat or another part of the construction."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 16,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Wooden Settle",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [],
          "tools": [],
          "steps": [
            {
              "step_number": 4,
              "instruction": "Take a side wood piece and a front post and glue the post on to one side edge of the sheet wood. The underside of the side wood piece and the post should be flush with each other.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A single piece of wood with a post glued to its side edge, flush at the bottom."
            },
            {
              "step_number": 5,
              "instruction": "Repeat the procedure described in step 4 with the remaining side wood piece and post, making this construction a mirror image of the previous one.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Two identical constructions, each consisting of a wood piece with a post glued to its side edge, flush at the bottom. They are mirror images of each other."
            },
            {
              "step_number": 6,
              "instruction": "Take the side panels and position the first panels at the top of each construction. Leave a gap of 5/8in before positioning the second horizontal panels. Position the third panels at the bottom of the constructions. Glue all the panels into place.",
              "technique": "gluing",
              "dimensions_mentioned": [
                "5/8in"
              ],
              "visual_description": "Two side panels, each with three horizontal wooden slats attached. The top and bottom slats are flush with the edges, and the middle slat is positioned with a 5/8 inch gap from the top slat."
            },
            {
              "step_number": 7,
              "instruction": "Turn the panelled sides over to face down, with the wider gap between the panels at the bottom of the structures. Mark 1 1/4in upwards from the bottom of each construction. Glue a seat support on the marked line on each side wood piece.",
              "technique": "gluing",
              "dimensions_mentioned": [
                "1 1/4in"
              ],
              "visual_description": "Two side panel constructions are shown face down. A horizontal line is marked 1 1/4 inches from the bottom edge of each. A seat support piece is glued onto this line."
            },
            {
              "step_number": 8,
              "instruction": "Take the front wood piece (grain to run with the shortest length) and position two horizontal front panels on top of the wood, as shown. Place the vertical front panel centrally between the horizontal panels and glue into place.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A front wood piece with two horizontal panels glued to its top surface. A vertical front panel is then glued centrally between the two horizontal panels."
            },
            {
              "step_number": 9,
              "instruction": "Position and glue the front construction between the two side constructions, with the front butting up to the end of the seat supports. Position the back construction so the inside edges of the back posts are in line with the side sheet wood pieces.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "The front construction is glued between the two side constructions. The front piece butts up against the seat supports. The back construction is positioned so its inner edges align with the outer edges of the side pieces."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "The sliding seat of the settle would have been a useful space to store linen and other household items. See tips on page 20 for details of the contents shown here."
          ],
          "finished_product_description": "A wooden settle with a front panel, side panels, and seat supports. The image shows a finished settle with a small cloth and plate inside."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Step 4: A single piece of wood with a post glued to its side edge, flush at the bottom.",
        "Step 5: Two identical constructions, each consisting of a wood piece with a post glued to its side edge, flush at the bottom. They are mirror images of each other.",
        "Step 6: Two side panels, each with three horizontal wooden slats attached. The top and bottom slats are flush with the edges, and the middle slat is positioned with a 5/8 inch gap from the top slat.",
        "Step 7: Two side panel constructions are shown face down. A horizontal line is marked 1 1/4 inches from the bottom edge of each. A seat support piece is glued onto this line.",
        "Step 8: A front wood piece with two horizontal panels glued to its top surface. A vertical front panel is then glued centrally between the two horizontal panels.",
        "Step 9: The front construction is glued between the two side constructions. The front piece butts up against the seat supports. The back construction is positioned so its inner edges align with the outer edges of the side pieces.",
        "Finished product: A wooden settle with a front panel, side panels, and seat supports. The image shows a finished settle with a small cloth and plate inside."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 17,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Box-Seat Settle",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "wood piece for base",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "seat wood piece",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "horizontal back panel",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "vertical back panel",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "wooden doorknobs",
              "quantity": "2",
              "dimensions": null,
              "color": null
            },
            {
              "item": "fine wool cloth and cotton",
              "quantity": "folded pieces",
              "dimensions": null,
              "color": null
            },
            {
              "item": "aluminium dinner plates",
              "quantity": "2",
              "dimensions": "13/16in diameter",
              "color": "aluminium"
            },
            {
              "item": "pewter enamel spray paint",
              "quantity": "1 can",
              "dimensions": null,
              "color": "pewter"
            }
          ],
          "tools": [
            {
              "name": "drill bit",
              "purpose": "to drill holes",
              "optional": false,
              "dimensions": "1/16in"
            },
            {
              "name": "glue",
              "purpose": "assembly",
              "optional": false
            },
            {
              "name": "spray paint",
              "purpose": "to create pewter plates",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 10,
              "instruction": "Take the base wood piece and glue it into the bottom of the box-seat settle so all outside edges are flush.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A close-up of the bottom of a wooden box-seat settle with a piece of wood being glued into place."
            },
            {
              "step_number": 11,
              "instruction": "Slide the seat wood piece on to the settle. Glue a horizontal back panel on to the back immediately above the seat, allowing for the removal of the seat. Position and glue the remaining vertical back panel and horizontal back panel as shown, together with the arm rests.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A close-up of the back of a wooden box-seat settle showing the seat piece and back panels being glued into place."
            },
            {
              "step_number": 12,
              "instruction": "Use a 1/16in drill bit to drill a hole centrally into the top of each back post. Glue the wooden doorknobs into place, as shown in the main photograph on page 18.",
              "technique": "drilling, gluing",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "A close-up of the top of a wooden back post of a box-seat settle, showing a hole drilled centrally and a wooden doorknob being glued into place."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "You can create the pewter plates shown in the settle on page 19 by spraying 13/16in diameter aluminium dinner plates with pewter enamel spray paint.",
            "Fill the settle with folded pieces of fine wool cloth and cotton to imitate bedding."
          ],
          "finished_product_description": "A rustic, painted box-seat settle with a cat lying on the seat."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A close-up of the bottom of a wooden box-seat settle with a piece of wood being glued into place.",
        "A close-up of the back of a wooden box-seat settle showing the seat piece and back panels being glued into place.",
        "A close-up of two round, dark-colored plates stacked on top of each other.",
        "A close-up of the corner of a painted wooden structure, showing distressed paint.",
        "A close-up of the top of a wooden back post of a box-seat settle, showing a hole drilled centrally and a wooden doorknob being glued into place.",
        "A close-up of folded pieces of textured fabric, appearing to be wool and cotton.",
        "A finished box-seat settle, painted green, with a small, fluffy cat lying on the seat."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 18,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A room with light green walls, decorated with a classical style border at the top. A white door is on the left. A pedestal with a bust of a head stands to the right of the door. A console table with a bowl on top is in the center. A mirror with an ornate frame hangs on the wall above the console table. Two vertical wall decorations with silhouette portraits are on either side of the mirror. The text 'Classical Style' is at the bottom of the image."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 19,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Console Table",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Obecchi sheet wood",
              "quantity": "1 piece",
              "dimensions": "2 1/2in x 1 1/4in",
              "notes": "1/16in thick"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1 piece",
              "dimensions": "2 3/4in length",
              "notes": "1/4in x 1/8in, for front"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "2 pieces",
              "dimensions": "1 1/4in lengths",
              "notes": "1/4in x 1/8in, for sides"
            },
            {
              "item": "Filigree decorations",
              "quantity": "1 set"
            },
            {
              "item": "Florist's stub wire",
              "quantity": "2 pieces",
              "dimensions": "2 1/4in lengths",
              "notes": "22-gauge"
            },
            {
              "item": "Gold-plated fluted tube beads",
              "quantity": "4 pieces",
              "dimensions": "25mm x 4mm"
            },
            {
              "item": "Gold-plated round beads",
              "quantity": "4 pieces",
              "dimensions": "4mm diameter"
            },
            {
              "item": "Cream spray paint",
              "quantity": "1 can"
            },
            {
              "item": "Gold metallic paste",
              "quantity": "1 pot"
            },
            {
              "item": "Marble-effect card",
              "quantity": "1 piece",
              "dimensions": "2 13/16in x 1 7/16in"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            },
            {
              "item": "Superglue gel",
              "quantity": "1 tube"
            }
          ],
          "tools": [
            {
              "name": "Sandpaper",
              "purpose": "To sand edges smooth and round corners",
              "optional": false,
              "notes": "Fine-grade"
            },
            {
              "name": "Small pliers",
              "purpose": "To cut filigrees",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the wood pieces for the front and sides and glue them to the outside edges of the obecchi sheet wood piece as shown. Once dry, use fine-grade sandpaper to sand the edges smooth and to slightly round the two corners at the front of the table.",
              "technique": "gluing, sanding",
              "visual_description": "A rectangular piece of wood with two smaller pieces glued to its longer sides, forming a shallow box shape. The corners of the front piece are rounded."
            },
            {
              "step_number": 2,
              "instruction": "Position and glue the filigree decorations symmetrically to the front and sides of the table-top using tacky glue. It may be necessary to glue each side separately, allowing each to dry before continuing with the next. Cut the filigrees with small pliers to ensure a good fit.",
              "technique": "gluing",
              "visual_description": "A flat piece of wood (table-top) with decorative filigree pieces glued symmetrically to its front and side edges. There are also smaller decorative elements and beads shown."
            },
            {
              "step_number": 3,
              "instruction": "To make the legs, take a length of florist's stub wire and thread on two tube beads and two round beads, using superglue gel to fix into place. Repeat with the remaining wire and beads. Spray the table-top and legs with cream spray paint and leave to dry.",
              "technique": "threading, gluing, spray painting",
              "visual_description": "A length of wire with two cylindrical beads and two round beads threaded onto it, forming a leg. Another similar leg is shown. The table-top and legs are shown painted cream."
            },
            {
              "step_number": 4,
              "instruction": "Rub over the table-top and legs with gold paste to highlight the filigrees and accentuate the fluted legs. Before gluing the marble-effect card on the top, round the corners slightly on one long side, in line with the table-top. Superglue the legs into place.",
              "technique": "rubbing, gluing",
              "visual_description": "The console table with gold paste applied to highlight details. A piece of marble-effect card with rounded corners is shown, ready to be glued to the table-top. The legs are shown attached."
            }
          ],
          "tips": [
            "To give a sheen to the marble-effect card, ensure that it is securely stuck to the table-top before covering it with a 3-D gloss varnish (see page 9)."
          ],
          "finished_product_description": "A miniature console table with decorative filigree on the front and sides, fluted legs, and a marble-effect top."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A drawing of a console table with two front legs and a decorative front panel.",
        "A close-up of a rectangular piece of wood, possibly the base of the table.",
        "A flat lay of decorative filigree pieces, beads, and wire, arranged as they would be applied to the table.",
        "A close-up of the table-top with filigree decorations applied.",
        "A close-up of the legs being constructed by threading beads onto wire.",
        "A close-up of the finished console table showing the marble-effect top and gold highlighting."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 20,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Neo-classical Mirror",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Obechi strip wood",
              "quantity": "two",
              "dimensions": "3/16in x 1/16in",
              "notes": "2 1/4in lengths"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "two",
              "dimensions": "3/16in x 1/16in",
              "notes": "2in lengths"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "two",
              "dimensions": "1/8in x 1/16in",
              "notes": "2 1/4in lengths"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "two",
              "dimensions": "1/8in x 1/16in",
              "notes": "2in lengths"
            },
            {
              "item": "Plastic mirror",
              "quantity": "1",
              "dimensions": "2in x 1 3/4in"
            },
            {
              "item": "Gold-plated filigree strips",
              "quantity": "three"
            },
            {
              "item": "Tiny gold-plated filigree flowers",
              "quantity": "three"
            },
            {
              "item": "Gold-plated spokes",
              "quantity": "two"
            },
            {
              "item": "Brass eyelets",
              "quantity": "two",
              "dimensions": "3mm"
            },
            {
              "item": "Slim white cake candles",
              "quantity": "two"
            },
            {
              "item": "Cream spray paint",
              "quantity": "1 can"
            },
            {
              "item": "Gold metallic paste",
              "quantity": "1 pot"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            },
            {
              "item": "Superglue gel",
              "quantity": "1 tube"
            }
          ],
          "tools": [
            {
              "name": "Mitre box and saw",
              "purpose": "Cutting wood at angles",
              "optional": false
            },
            {
              "name": "Sandpaper",
              "purpose": "Smoothing edges",
              "optional": false,
              "notes": "Fine-grade"
            },
            {
              "name": "Pliers",
              "purpose": "Cutting filigree",
              "optional": true
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the four lengths of 3/16in x 1/16in strip wood and mitre the ends of each to an angle of 45 degrees. Position and glue the mitred wood strips together as shown. Repeat the procedure with the 1/8in x 1/16in strip wood pieces.",
              "technique": "mitring, gluing",
              "dimensions_mentioned": [
                "3/16in x 1/16in",
                "1/8in x 1/16in",
                "45 degrees"
              ],
              "visual_description": "Two square frames made of wood strips, one slightly smaller than the other."
            },
            {
              "step_number": 2,
              "instruction": "Position and glue the 1/8in wide strip wood construction on top of the 3/16in wide strip wood construction to make a frame for the mirror and leave to dry. Use fine-grade sandpaper to sand smooth the side edges and corners of the frame.",
              "technique": "gluing, sanding",
              "dimensions_mentioned": [
                "1/8in",
                "3/16in"
              ],
              "visual_description": "A wooden frame with two layers of strips, showing smooth edges."
            },
            {
              "step_number": 3,
              "instruction": "Place the frame with the 3/16in wide strip wood facing upwards and position and glue the filigree decorations symmetrically around the frame, ensuring that space is left for the sconces. Cut the filigrees with small pliers if necessary to ensure a good fit.",
              "technique": "gluing, cutting",
              "dimensions_mentioned": [
                "3/16in"
              ],
              "visual_description": "A wooden frame decorated with gold filigree patterns, with spaces for sconces."
            },
            {
              "step_number": 4,
              "instruction": "Remove two rods on each spoke and bend into an L shape. Superglue the sconce components together and on to the frame. Spray the frame with cream spray paint. Once dry, rub over with gold paste to highlight the filigrees. Glue mirror and candles into place.",
              "technique": "bending, gluing, spray painting, rubbing",
              "dimensions_mentioned": [],
              "visual_description": "Sconce components bent into L-shapes, a fully decorated frame with mirror and candles attached."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Revivals of the neo-classical style make this type of mirror suitable, more or less, up to the beginning of the 20th century.",
            "Frames can be decorated using a variety of filigrees and jewellery findings.",
            "Spray with old gold spray paint to achieve the effect of gilt wood."
          ],
          "finished_product_description": "A neo-classical style mirror frame decorated with gold filigree, featuring two candle sconces."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A gilded mirror frame with two candle holders attached to the base.",
        "Two empty square wooden frames, one slightly smaller than the other, showing the layered construction.",
        "A single square wooden frame with intricate gold filigree decorations applied symmetrically around its edges.",
        "A collection of small gold-colored metal components, including spoke-like pieces and circular elements, likely for attaching sconces.",
        "A completed neo-classical mirror frame, decorated with gold filigree, with a mirror inserted and two white candles placed in the sconces."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 21,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Pedestals",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "obechii sheet wood",
              "quantity": "4 pieces",
              "dimensions": "3in x 7/8in",
              "notes": "for wide sides"
            },
            {
              "item": "obechii sheet wood",
              "quantity": "4 pieces",
              "dimensions": "3in x 11/16in",
              "notes": "for narrow sides"
            },
            {
              "item": "obechii sheet wood",
              "quantity": "2 pieces",
              "dimensions": "1in x 1in",
              "notes": "for lower tops"
            },
            {
              "item": "obechii sheet wood",
              "quantity": "2 pieces",
              "dimensions": "1 1/8in x 1 1/8in",
              "notes": "for upper tops"
            },
            {
              "item": "obechii sheet wood",
              "quantity": "2 pieces",
              "dimensions": "1in x 1in",
              "notes": "for upper bases"
            },
            {
              "item": "obechii sheet wood",
              "quantity": "2 pieces",
              "dimensions": "1 1/8in x 1 1/8in",
              "notes": "for lower bases"
            },
            {
              "item": "gold peel-off motifs",
              "quantity": "1 sheet",
              "notes": "containing borders and scrolls"
            },
            {
              "item": "gold peel-off motifs",
              "quantity": "1 sheet",
              "notes": "containing straight borders"
            },
            {
              "item": "Antique white water-based acrylic paint",
              "quantity": "1 can"
            },
            {
              "item": "Gold metallic paste",
              "quantity": "1 pot"
            },
            {
              "item": "Fine-grade wire wool",
              "quantity": "1 roll"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            }
          ],
          "tools": [
            {
              "name": "fine-grade sandpaper",
              "purpose": "sanding edges",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Use fine-grade sandpaper to sand the edges of all of the wooden components. Position and glue two narrow sides between two wide sides, so that all outside edges are flush with each other. Repeat this procedure for the second pedestal.",
              "technique": "sanding, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a rectangular piece of wood with a layered effect, suggesting it is made of multiple pieces glued together."
            },
            {
              "step_number": 2,
              "instruction": "Take the lower top wood pieces and glue centrally to the upper top wood pieces, with the grains of each wood piece running in opposite directions to each other to prevent warping. Repeat the procedure with the lower base and upper base wood pieces.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows two small square pieces of wood, with wood grain running in opposite directions on each piece."
            },
            {
              "step_number": 3,
              "instruction": "Position and glue the glued-wood sections centrally to each end of the column. Repeat for the second pedestal. Remove the peel-off stickers from the sheets and position on each side of the pedestals, ensuring the straight borders cover the joints.",
              "technique": "gluing, applying stickers",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a rectangular wooden piece with decorative patterns applied to its surface, resembling a section of the pedestal."
            },
            {
              "step_number": 4,
              "instruction": "Paint the pedestals with antique white acrylic paint and leave to dry. Rub a small amount of gold metallic paste lightly over each pedestal. Add character and depth by gently rubbing with wire wool to give a sheen and highlight the decorative motifs.",
              "technique": "painting, applying paste, rubbing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a rectangular wooden piece with decorative patterns, painted white and highlighted with gold metallic paste."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Pedestals can be painted to represent various materials to suit home or garden from the 16th century onwards.",
            "The pedestal sides have been reduced to 2in and filigrees used as decoration.",
            "A plaster model was painted to match the stone-effect pedestal."
          ],
          "finished_product_description": "Decorative pedestals for display."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image shows two ornate, tall, rectangular pedestals, one slightly behind the other, with decorative patterns on their sides.",
        "Image shows a close-up of a rectangular wooden piece, likely a component for the pedestal, showing its layered construction.",
        "Image shows two small square wooden pieces, demonstrating wood grain direction.",
        "Image shows a decorative section of a pedestal, likely with applied motifs.",
        "Image shows a finished decorative section of a pedestal, painted and highlighted.",
        "Image shows a finished pedestal with a small statue on top."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 22,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Ornamental Mask",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Face mould",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Polymer clay",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Talcum powder",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Stone-effect paint (or grey and cream acrylic water-based paint, mixed with a little sand and tacky glue)",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Obechi sheet wood",
              "quantity": "1",
              "dimensions": "1/8in thick, 1/2in x 1/2in",
              "color": null
            },
            {
              "item": "Cocktail stick",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "Domestic oven",
              "purpose": "baking clay",
              "optional": false
            },
            {
              "name": "Drill bit",
              "purpose": "drilling hole",
              "optional": false,
              "details": "1/16in"
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "The mould shown here is from a set of body sugar-craft moulds. Before using the mould dust it with talcum powder each time.",
              "technique": "dusting mould",
              "dimensions_mentioned": [],
              "visual_description": "A rectangular mould with a face impression inside."
            },
            {
              "step_number": 2,
              "instruction": "Roll a ball of polymer clay to the required size and shape it into a teardrop as shown. Point the narrow end into the nose of the mould, pressing and smoothing the back as shown.",
              "technique": "shaping clay",
              "dimensions_mentioned": [],
              "visual_description": "A teardrop-shaped piece of clay being pressed into a face mould. The back of the mould is shown smoothed."
            },
            {
              "step_number": 3,
              "instruction": "Ease the clay gently out of the mould and trim the neck. Harden the clay by baking in a domestic oven following the manufacturer's instructions. Once cool, use a 1/16in drill bit and drill a hole up through the neck.",
              "technique": "trimming, baking, drilling",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "Two clay masks with trimmed necks. A small square with an 'X' pattern is shown. A clay mask with a hole drilled through the neck is shown on a stand."
            },
            {
              "step_number": 4,
              "instruction": "Make a stand by drilling a 1/16in hole through the centre of the piece of obechi wood. Join the head and base using a short length of cocktail stick. Paint with stone-effect paint or with cream and grey acrylic paint mixed with a little sand and tacky glue.",
              "technique": "drilling, assembling, painting",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "A small square piece of wood with a hole in the center. A finished mask on a stand, painted with a stone effect."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A small ornamental mask made from polymer clay, designed to look like stone, mounted on a small wooden stand."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A small bust of a classical figure, possibly a statue or a mould.",
        "A close-up of a face mould.",
        "A teardrop-shaped piece of polymer clay being shaped into a mask.",
        "Two finished clay masks with trimmed necks.",
        "A small square piece of wood with an 'X' pattern, likely a base for a stand.",
        "A finished ornamental mask mounted on a small wooden stand."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 23,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Neo-classical Vase",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "3mm width quilling paper",
              "quantity": "Packet",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Stone-effect paint (or grey and cream acrylic water-based paint, mixed with a little sand and tacky glue)",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "Quilling tool",
              "purpose": "twisting paper",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a strip of quilling paper and place one end into the slot at the top of the quilling tool and begin to twist the handle. At the same time wind the paper tightly and neatly around the top of the tool until the whole strip has been coiled. Secure the ends with a dab of glue.",
              "technique": "coiling",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a quilling tool with a strip of paper being wound around it."
            },
            {
              "step_number": 2,
              "instruction": "Take another strip of quilling paper and dab glue on to one end. Place on the coil so the glued area overlaps the previous end and continue to wind around in the same way. Remove from the quilling tool and repeat the procedure, using your fingers, until the paper coil measures 3/4in diameter.",
              "technique": "coiling",
              "dimensions_mentioned": [
                "3/4in"
              ],
              "visual_description": "Image shows a quilling tool with a paper coil being wound around it, with the glued end overlapping the previous end. A second image shows a completed paper coil."
            },
            {
              "step_number": 3,
              "instruction": "Following the previous steps make another paper coil to measure 1 1/8in diameter. Taking one of the coils, use your fingers to gently and carefully press and ease the paper outwards to form a bowl shape. Repeat with the remaining paper coil.",
              "technique": "coiling, shaping",
              "dimensions_mentioned": [
                "1 1/8in"
              ],
              "visual_description": "Image shows two paper coils, one smaller and one larger. The larger coil is being shaped outwards with fingers to form a bowl."
            },
            {
              "step_number": 4,
              "instruction": "Paint the bowls and fill the holes inside and out with diluted tacky glue and leave to dry. Position the larger bowl on top of the upturned smaller bowl and glue into position. Paint with stone-effect paint or with a paint, sand and glue mixture.",
              "technique": "painting, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a larger bowl placed on top of an upturned smaller bowl, forming a vase shape."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "It is advisable to practise making small single bowls and vases before attempting the larger vase. Follow the steps, first coiling paper to measure approximately 1/2in diameter and using the end of a pencil to press and ease it into shape. Paint your bowls and vases according to your requirements."
          ],
          "finished_product_description": "A neo-classical style vase made from coiled paper, painted to resemble stone."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image of a finished neo-classical vase.",
        "Image of a quilling tool.",
        "Image of a quilling tool with paper being wound.",
        "Image of a completed paper coil.",
        "Image of two paper coils, one being shaped into a bowl.",
        "Image of a larger bowl placed on top of a smaller upturned bowl to form a vase."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 24,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Topiary Trees",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "cocktail sticks",
              "quantity": "4"
            },
            {
              "item": "egg-shaped paper balls",
              "quantity": "2",
              "dimensions": "1in"
            },
            {
              "item": "green scenic scatter material"
            },
            {
              "item": "terracotta plant pots",
              "quantity": "2",
              "dimensions": "1in high"
            },
            {
              "item": "decorative braid",
              "dimensions": "5mm width, 8in length"
            },
            {
              "item": "water-based acrylic paint"
            },
            {
              "item": "gold metallic paste"
            },
            {
              "item": "dry tea leaves"
            },
            {
              "item": "tacky glue"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Paint two cocktail sticks with brown acrylic paint to represent a tree trunk. Use the remaining cocktail sticks to temporarily hold the paper balls and paint with green acrylic paint. Once dry, cover the balls with diluted tacky glue, dip them into the scatter material and leave to dry. If the scatter coverage is insufficient repeat the procedure after the glue has totally dried.",
              "technique": "painting, gluing, dipping",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a cocktail stick and two paper balls, one plain white and one green."
            },
            {
              "step_number": 2,
              "instruction": "Position and glue the decorative braid around the top of each plant pot. Paint with acrylic paint and once dry rub over with gold paste. Mix dry tea leaves with tacky glue and press into each pot for soil. Place a painted cocktail stick into each ball and 'plant' before the soil mixture dries.",
              "technique": "gluing, painting, mixing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows two plant pots, one with decorative braid around the top and painted, the other with braid and painted with gold paste. The second pot also has soil mixture in it."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "When making topiary, unvarnished wooden beads may be used to create the rounded shapes instead of paper balls, as in the tree, far right."
          ],
          "finished_product_description": "Two small topiary trees in pots, one with a single ball top and the other with a triple ball top."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Photo showing two finished topiary trees in pots. The tree on the left has a single ball top, and the tree on the right has a triple ball top.",
        "Image showing a cocktail stick and two paper balls, one plain white and one green.",
        "Image showing two plant pots, one with decorative braid around the top and painted, the other with braid and painted with gold paste. The second pot also has soil mixture in it."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 25,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Framed Silhouettes",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Gold-plated oval pendant frame",
              "quantity": "1",
              "dimensions": "5/16in x 3/8in",
              "color": "gold-plated"
            },
            {
              "item": "Black enamel spray paint",
              "quantity": "1 can",
              "color": "black"
            },
            {
              "item": "White paper for photocopying",
              "quantity": "1 sheet",
              "color": "white"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle",
              "color": "clear"
            },
            {
              "item": "3-D gloss varnish",
              "quantity": "1 bottle",
              "color": "clear"
            },
            {
              "item": "Brown shoe polish",
              "quantity": "small amount",
              "color": "brown"
            },
            {
              "item": "Silk ribbon",
              "quantity": "1 piece",
              "dimensions": "2mm wide",
              "color": "any"
            },
            {
              "item": "Bow",
              "quantity": "1",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "Scissors",
              "purpose": "cutting silhouettes",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Spray the front of the frame with black enamel spray paint. Colour photocopy the small oval-bordered silhouette templates on page 61 on to white paper.",
              "technique": "spray painting, photocopying",
              "visual_description": "Image shows a frame being sprayed black, and a sheet of paper with multiple small oval silhouette templates."
            },
            {
              "step_number": 2,
              "instruction": "Use small, sharp scissors to cut around the border of a silhouette. Rub a small amount of tacky glue on to the underside, then position and glue the silhouette in the centre of the black oval frame.",
              "technique": "cutting, gluing",
              "visual_description": "Image shows a silhouette being cut out with scissors, and then being glued into the center of a black oval frame."
            }
          ],
          "blueprint_data": null,
          "finished_product_description": "A framed silhouette portrait.",
          "tips": [
            "To antique a metal frame, spray the front with black enamel spray paint. Once dry, rub the smallest amount of gold paste over the frame to highlight any raised areas."
          ]
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Oval-bordered silhouette templates",
          "scale": "original size",
          "shape_description": "Small oval silhouettes with borders."
        },
        {
          "name": "Larger oval silhouette templates",
          "scale": "original size",
          "shape_description": "Larger oval silhouettes."
        }
      ],
      "diagram_descriptions": [
        "A row of six small oval silhouette portraits in black frames.",
        "A sheet of paper with six small oval silhouette templates.",
        "A gold oval frame and a black oval frame.",
        "A black oval frame with a silhouette glued in the center.",
        "A framed silhouette portrait with an ornate gold frame.",
        "A close-up of an ornate gold frame.",
        "A vertical arrangement of three framed silhouettes, connected by ribbon and topped with a bow."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 26,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A diorama scene with a country style theme. It features a light-colored wall, a wooden shelf with books and decorative plates, a small white table with a bird figurine and candles, a blue chair with books stacked on it, and a large woven basket filled with logs. A hanging basket and dried lavender are also visible. The text \"Country Style\" is displayed below the scene."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 27,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Side Table",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "obechi sheet wood",
              "quantity": "1/16in thick",
              "dimensions": "2 3/8in x 1 13/16in",
              "purpose": "table-top"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1/4in x 1/8in",
              "dimensions": "two 2in lengths",
              "purpose": "long table-top supports"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1/4in x 1/8in",
              "dimensions": "two 7/8in",
              "purpose": "short table-top supports"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1/8in x 1/8in",
              "dimensions": "four 2 1/8in",
              "purpose": "legs"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1/8in x 1/8in",
              "dimensions": "2in length",
              "purpose": "long leg support"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1/8in x 1/8in",
              "dimensions": "two 7/8in",
              "purpose": "short leg supports"
            },
            {
              "item": "Water-based acrylic paint",
              "quantity": "1",
              "purpose": "painting"
            },
            {
              "item": "Water-based wood stain",
              "quantity": "1",
              "purpose": "staining"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "purpose": "assembly"
            }
          ],
          "tools": [
            {
              "name": "Gluing jig",
              "purpose": "holding pieces while gluing",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Sand each of the individual wooden components. Place two legs, a short table-top support and a short leg support (positioned 1/4in from the end of each leg) in a right-angled gluing jig and glue together. Repeat the procedure with the remaining two legs and short supports.",
              "technique": "sanding, gluing",
              "dimensions_mentioned": [
                "1/4in"
              ],
              "visual_description": "A diagram showing two legs, a short table-top support, and a short leg support assembled in a right-angled jig."
            },
            {
              "step_number": 2,
              "instruction": "Once dry, take the leg constructions and place downwards in a gluing jig. Position the long table-top supports between the leg structures and glue into place. Glue the long leg support centrally between the two short leg supports.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A diagram showing the two leg constructions placed downwards in a jig, with long table-top supports being positioned between them."
            },
            {
              "step_number": 3,
              "instruction": "Glue the table-top in position so that at the back the side edge is flush with the leg structure, while the remaining side edges and front overhang by 1/16in. Paint the table using water-based acrylic paints (see page 12 for distressing technique).",
              "technique": "gluing, painting",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "A diagram showing the table-top being glued onto the leg structure, with an overhang at the front and sides. A close-up inset shows the finished table with a drawer and shelf."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "This side table was shoe polished before construction, with a false drawer and shelf added to the basic structure. Use the template on page 62 to cut out two wood pieces from 1/16in thick obechi sheet wood. Position and glue one piece under the table-top supports and the other on top of the leg supports. Glue two wooden drawer knobs to the front of the false drawer to complete the look."
          ],
          "finished_product_description": "A country-style side table, painted and distressed."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "False drawer and shelf template",
          "scale": null,
          "shape_description": "Template for cutting two wood pieces for the false drawer and shelf."
        }
      ],
      "diagram_descriptions": [
        "A photograph of a finished side table with a light wood finish, standing on a white background.",
        "A diagram illustrating step 1 of the side table construction, showing the assembly of legs and supports in a jig.",
        "A diagram illustrating step 2 of the side table construction, showing the placement of long table-top supports.",
        "A diagram illustrating step 3 of the side table construction, showing the table-top being glued.",
        "A close-up inset image of the finished side table, highlighting the false drawer and shelf detail."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 28,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Side Chair",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "obechí strip wood",
              "quantity": "2",
              "dimensions": "7/8in x 7/8in",
              "notes": "for back legs"
            },
            {
              "item": "obechí strip wood",
              "quantity": "2",
              "dimensions": "1 3/8in",
              "notes": "for front legs"
            },
            {
              "item": "obechí strip wood",
              "quantity": "6",
              "dimensions": "1in",
              "notes": "for slats"
            },
            {
              "item": "obechí strip wood",
              "quantity": "4",
              "dimensions": "1in",
              "notes": "for seat supports"
            },
            {
              "item": "obechí sheet wood",
              "quantity": "1",
              "dimensions": "1/16in thick",
              "notes": "for seat"
            },
            {
              "item": "obechí sheet wood",
              "quantity": "1",
              "dimensions": "1 1/4in x 1 1/4in",
              "notes": "for seat"
            },
            {
              "item": "Water-based acrylic paints",
              "quantity": "1",
              "notes": "any color"
            },
            {
              "item": "Water-based wood stain",
              "quantity": "1",
              "notes": "any color"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "notes": "any brand"
            }
          ],
          "tools": [
            {
              "name": "gluing jig",
              "purpose": "holding pieces while gluing",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Sand each of the wooden components. Position a slat and a seat support between two front legs, place into a right-angled gluing jig (see page 8) and glue into position, referring to the template on page 62.",
              "technique": "sanding, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Close-up of the bottom front section of the chair being assembled in a jig. Two front legs are visible with a horizontal slat and a vertical seat support positioned between them."
            },
            {
              "step_number": 2,
              "instruction": "Position three slats and a seat support between two back legs, place into the gluing jig and glue into position, referring to the template on page 62.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Close-up of the bottom back section of the chair being assembled in a jig. Two back legs are visible with three horizontal slats and a vertical seat support positioned between them."
            },
            {
              "step_number": 3,
              "instruction": "Turn the back and front constructions on their sides and place into the jig. Position and glue a slat and seat support between the leg structures and in line with the other supports. Repeat the procedure on the opposite side of the chair.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Close-up of the chair frame being assembled. The front and back leg assemblies are shown connected by slats and seat supports. The jig is visible holding the pieces in place."
            },
            {
              "step_number": 4,
              "instruction": "Take the seat piece and mark 1/8in square out of the corners on a side that has the grain running along. Remove the two sections, first cutting against the grain to avoid splitting. Glue the seat on the frame and once dry see page 12 for paint distressing.",
              "technique": "cutting, gluing, distressing",
              "dimensions_mentioned": [
                "1/8in square"
              ],
              "visual_description": "Two square pieces of wood, likely the seat, are shown with small squares marked and cut out from their corners. The grain direction is indicated."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Refer to template on page 62 for positioning.",
            "See page 12 for paint distressing instructions."
          ],
          "finished_product_description": "A miniature wooden side chair with a simple design, featuring four legs, a seat, and a back with horizontal slats."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Side Chair Template",
          "scale": null,
          "shape_description": "Used for positioning slats and seat supports during assembly. Specific details not visible in the provided image."
        }
      ],
      "diagram_descriptions": [
        "A full-view image of a completed miniature wooden side chair, painted a pale green.",
        "Diagram 1 shows the assembly of the front legs and seat support.",
        "Diagram 2 shows the assembly of the back legs and seat support.",
        "Diagram 3 shows the connection of the front and back leg assemblies with additional slats and supports.",
        "Diagram 4 shows the seat piece with corner sections marked for removal."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 29,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Wall Shelves",
          "category": "woodworking",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "obechistrip wood",
              "quantity": "two",
              "dimensions": "1/2in x 1/16in",
              "notes": "lengths for sides"
            },
            {
              "item": "obechistrip wood",
              "quantity": "two",
              "dimensions": "7/16in x 1/16in",
              "notes": "lengths for shelves"
            },
            {
              "item": "obechistrip wood",
              "quantity": "two",
              "dimensions": "1/8in x 1/16in",
              "notes": "for back supports"
            },
            {
              "item": "hardwood dowel",
              "quantity": "1",
              "dimensions": "3/8in diameter"
            },
            {
              "item": "Light brown wood stain",
              "quantity": "1"
            },
            {
              "item": "Tacky glue",
              "quantity": "1"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a back support wood piece and mark 1/8in along from one corner of the wood. Join the mark to the corner opposite and remove the triangular section. Use fine-grade sandpaper to gently sand the wood smooth. Repeat the procedure with the other back support.",
              "technique": "sanding",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "Three pieces of wood. The first piece is a rectangular strip. The second and third pieces are also rectangular strips, with a triangular section removed from one corner, creating a beveled edge."
            },
            {
              "step_number": 2,
              "instruction": "Take the side wood pieces and mark 5/16in along from one corner on each and remove the triangular sections. Wind a piece of fine-grade sandpaper around the piece of dowel, place the two side wood pieces together and sand and shape the cut sections of the wood as shown.",
              "technique": "sanding",
              "dimensions_mentioned": [
                "5/16in"
              ],
              "visual_description": "Three pieces of wood. The first piece is a rectangular strip. The second and third pieces are rectangular strips with a triangular section removed from one corner, creating a beveled edge. The beveled edges are shown together, suggesting they will be sanded to match."
            },
            {
              "step_number": 3,
              "instruction": "Position the side wood pieces to be a mirror image of each other. From the straight end on each, mark across at 1/8in and then 1in. Sand the remaining wooden components using fine-grade sandpaper and then stain with a light brown wood stain.",
              "technique": "sanding, staining",
              "dimensions_mentioned": [
                "1/8in",
                "1in"
              ],
              "visual_description": "Two pieces of wood, positioned as mirror images. Each piece has two pencil marks across its width, one at 1/8in from the straight end and another at 1in from the straight end. The pieces are shown with the marked sections ready for sanding."
            },
            {
              "step_number": 4,
              "instruction": "Position and glue the back supports on top of the side wood pieces as shown, keeping all side edges flush. Take the two shelf wood pieces and position and glue the ends of each in line with the pencil marks on the shelf sides.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Two pieces of wood, representing the back supports, are shown positioned on top of the side wood pieces. The shelf wood pieces are shown positioned to be glued to the side pieces, with their ends aligned with pencil marks."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A two-tiered wall shelf made of wood."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A finished two-tiered wall shelf, made of light brown wood, shown from the front.",
        "A finished two-tiered wall shelf, made of light brown wood, shown from the front.",
        "Three pieces of wood, two of which have a triangular section removed from one corner, creating a beveled edge.",
        "Three pieces of wood, two of which have a triangular section removed from one corner, creating a beveled edge.",
        "Two pieces of wood, positioned as mirror images, with pencil marks indicating where to sand.",
        "Two pieces of wood, representing back supports, positioned on top of side pieces, and two shelf pieces positioned to be glued."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 30,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Books",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Obechi strip wood",
              "quantity": "1",
              "dimensions": "1/2in x 3/32in",
              "length": "4in"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "1",
              "dimensions": "3/8in x 3/32in",
              "length": "3in"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "1",
              "dimensions": "1/2in x 1/16in",
              "length": "4in"
            },
            {
              "item": "Obechi strip wood",
              "quantity": "1",
              "dimensions": "3/8in x 1/16in",
              "length": "3in"
            },
            {
              "item": "Coloured pastel paper",
              "quantity": "Selection"
            },
            {
              "item": "Water-based acrylic paint",
              "quantity": "1"
            },
            {
              "item": "Shoe polish",
              "quantity": "Brown and black"
            },
            {
              "item": "Gold metallic paste",
              "quantity": "1"
            },
            {
              "item": "Tacky glue",
              "quantity": "1"
            }
          ],
          "tools": [
            {
              "name": "Fine-grade sandpaper",
              "purpose": "Rounding edges",
              "optional": false
            },
            {
              "name": "Mitre block and saw",
              "purpose": "Cutting strips",
              "optional": true
            },
            {
              "name": "Mitre cutters",
              "purpose": "Cutting strips",
              "optional": true
            },
            {
              "name": "Knife",
              "purpose": "Making indentations",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the 1/2in x 3/32in strip of wood and use fine-grade sandpaper to gently round one long side edge, to create the effect of the book spine. Cut the strip into 5/8in lengths using either a mitre block and saw or mitre cutters. Sand any rough edges.",
              "technique": "rounding, cutting, sanding",
              "dimensions_mentioned": [
                "1/2in x 3/32in",
                "5/8in"
              ],
              "visual_description": "A strip of wood being rounded on one edge, and then cut into smaller pieces."
            },
            {
              "step_number": 2,
              "instruction": "Cut out a book cover from the pastel paper and rub the outside of the paper with a small amount of shoe polish or gold metallic paste to age it. Rub paste or shoe polish along the straight outside edges of a wooden block to create the effect of the pages.",
              "technique": "aging, rubbing",
              "dimensions_mentioned": [],
              "visual_description": "A piece of pastel paper being aged with shoe polish or gold paste, and a wooden block with its edges treated to look like pages."
            },
            {
              "step_number": 3,
              "instruction": "Rub a thin, even layer of tacky glue on the inside of the book cover and glue on to the block of wood. Use the blunt edge of a knife to make horizontal indentations on the spine of the book. Make more books using the remaining strip wood - see guide, left.",
              "technique": "gluing, indenting",
              "dimensions_mentioned": [],
              "visual_description": "A book cover being glued to a wooden block, and indentations being made on the spine."
            },
            {
              "step_number": 4,
              "instruction": "As an alternative to making paper book covers, paint some wooden blocks using water-based acrylic paints. Age the painted cover by lightly rubbing over shoe polish or gold paste. Position the painted books between paper-covered books for best results.",
              "technique": "painting, aging",
              "dimensions_mentioned": [],
              "visual_description": "Painted wooden blocks that have been aged, and a stack of paper-covered books."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Follow the guide below to make different sized books"
          ],
          "finished_product_description": "Miniature books made from wood strips and paper, designed to look like a pile or row of books on a shelf."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A row of miniature books with purple covers, standing upright.",
        "Two strips of light purple wood, one longer than the other, with two smaller pieces below.",
        "A light purple wooden block with a strip of wood on top, and a separate thin strip of wood standing upright.",
        "Two small purple squares, one slightly lighter than the other.",
        "A stack of miniature purple books, lying flat.",
        "A thin strip of purple wood standing upright.",
        "Two small purple squares, one slightly lighter than the other."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 31,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Log Basket",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "24-gauge white paper-covered floral wire",
              "quantity": "nine 7in lengths for stakes",
              "dimensions_mentioned": [
                "7in"
              ]
            },
            {
              "item": "24-gauge white paper-covered floral wire",
              "quantity": "two 1 1/2in lengths for handles",
              "dimensions_mentioned": [
                "1 1/2in"
              ]
            },
            {
              "item": "24-gauge white paper-covered floral wire",
              "quantity": "two 1in lengths for inside handles",
              "dimensions_mentioned": [
                "1in"
              ]
            },
            {
              "item": "Brown waxed thread",
              "quantity": "15m (16yd)",
              "dimensions_mentioned": [
                "15m",
                "16yd"
              ]
            },
            {
              "item": "Medium oak water-based wood stain"
            },
            {
              "item": "Cocktail stick"
            },
            {
              "item": "Tacky glue"
            },
            {
              "item": "Dried twigs for logs"
            }
          ],
          "tools": [
            {
              "name": "mitre cutters or a saw and mitre block",
              "purpose": "to cut dried twigs to fill your basket with miniature logs",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Stain all of the paper-covered wire with medium oak wood stain and leave to dry. Lay four stakes centrally on top of the remaining five stakes as shown above.",
              "technique": "staining",
              "visual_description": "Diagram shows four stakes laid horizontally, crossed by five vertical stakes in the center, forming a cross shape."
            },
            {
              "step_number": 2,
              "instruction": "Take the waxed thread and fold over a 5in length to form a loop. Begin to secure the stakes together by placing the loop around one group of stakes as shown above.",
              "technique": "weaving",
              "dimensions_mentioned": [
                "5in"
              ],
              "visual_description": "Diagram shows the cross shape of stakes from step 1. A loop of waxed thread is placed around the central intersection of the stakes."
            },
            {
              "step_number": 3,
              "instruction": "Take the thread that is under the first group of stakes, over the top of the second group of stakes. The thread that is over the first group should be brought under the second group of stakes.",
              "visual_description": "Diagram shows the stakes and thread from step 2. The thread is being woven around the stakes in an under-and-over pattern."
            },
            {
              "step_number": 4,
              "instruction": "Continue this under-and-over pattern neatly and evenly around the groups of stakes in three full circles. Trim the short excess length of weaving thread, dabbing on a tiny amount of tacky glue to hold it in place.",
              "dimensions_mentioned": [
                "three full circles"
              ],
              "visual_description": "Diagram shows the stakes with the thread woven around them in a circular pattern, forming a square base. The thread has been woven around three times."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Use mitre cutters or a saw and mitre block (shown on page 12) to cut dried twigs to fill your basket with miniature logs."
          ],
          "finished_product_description": "A woven basket filled with miniature logs."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A woven basket filled with cut logs.",
        "Diagram showing four stakes laid horizontally, crossed by five vertical stakes in the center, forming a cross shape.",
        "Diagram showing the cross shape of stakes from step 1. A loop of waxed thread is placed around the central intersection of the stakes.",
        "Diagram showing the stakes and thread from step 2. The thread is being woven around the stakes in an under-and-over pattern.",
        "Diagram showing the stakes with the thread woven around them in a circular pattern, forming a square base. The thread has been woven around three times."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 32,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Log Basket",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "waxed thread",
              "quantity": "12in lengths",
              "dimensions": "12in",
              "color": "ecru and brown"
            }
          ],
          "tools": [
            {
              "name": "wire cutters",
              "purpose": "cutting stakes",
              "optional": false
            },
            {
              "name": "cocktail stick",
              "purpose": "applying glue",
              "optional": false
            },
            {
              "name": "tacky glue",
              "purpose": "securing thread",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 5,
              "instruction": "Cut off one stake with wire cutters to leave seventeen - an uneven number is needed to weave alternately in and out of each stake. Begin to weave between the stakes, opening them out as you do so.",
              "technique": "weaving",
              "dimensions_mentioned": [],
              "visual_description": "Top-down view of stakes arranged in a cross shape with weaving starting in the center."
            },
            {
              "step_number": 6,
              "instruction": "Ensure the stakes remain evenly spaced during weaving and the weaving thread kept tight and even. Continue weaving until the base measures 1 1/8in diameter, then begin to bend the stakes upwards and outwards slightly.",
              "technique": "weaving",
              "dimensions_mentioned": [
                "1 1/8in"
              ],
              "visual_description": "A small, partially woven basket with stakes starting to bend upwards."
            },
            {
              "step_number": 7,
              "instruction": "Continue weaving until the basket is 1 1/8in high, ensuring the stakes remain slightly angled outwards. When the weaving is finished, use the end of cocktail stick to dab a tiny amount of tacky glue around the top of the basket next to the stakes.",
              "technique": "weaving",
              "dimensions_mentioned": [
                "1 1/8in"
              ],
              "visual_description": "A woven basket with stakes angled outwards, showing the top edge."
            },
            {
              "step_number": 8,
              "instruction": "Once the glue has dried, trim the stakes to the height of the woven thread using wire cutters. Trim the excess weaving thread and dab a tiny amount of tacky glue on the end to hold it in place inside the basket.",
              "technique": "trimming, gluing",
              "dimensions_mentioned": [],
              "visual_description": "A woven basket with trimmed stakes and a close-up of the top edge showing glue application."
            },
            {
              "step_number": 9,
              "instruction": "To make the border for the top of the basket, take six 12in lengths of waxed thread and using two together, plait into a length. Trim each end and glue on to the top of the basket to hide the ends of the wire stakes.",
              "technique": "plaiting, gluing",
              "dimensions_mentioned": [
                "12in"
              ],
              "visual_description": "A braided length of waxed thread and a close-up of the basket top with the braided border glued on."
            },
            {
              "step_number": 10,
              "instruction": "To make a handle, take a 1 1/2in and 1in length of wire. Place together and neatly wind around the waxed thread, leaving a 1/4in gap at each end of the wire. Use tacky glue to secure the thread at each end. Repeat with the remaining handle wires.",
              "technique": "wrapping, gluing",
              "dimensions_mentioned": [
                "1 1/2in",
                "1in",
                "1/4in"
              ],
              "visual_description": "Two pieces of wire placed together, being wrapped with waxed thread, showing gaps at the ends."
            },
            {
              "step_number": 11,
              "instruction": "Bend the handles into shape, then take a handle and glue each wire end in through the border and between the weaving. Repeat with the remaining handle on the opposite side. Chop twigs into small lengths and use to fill up the log basket.",
              "technique": "shaping, gluing, filling",
              "dimensions_mentioned": [],
              "visual_description": "A handle being attached to the basket and a finished basket with a handle."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "If you come to the end of the thread whilst weaving, join a new length behind a stake on the inside of the basket, as above."
          ],
          "finished_product_description": "A small, rustic log basket with a handle."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Diagram showing how to join a new thread during weaving.",
        "Illustration of stakes being woven and bent outwards.",
        "Illustration of a partially woven basket with stakes bending upwards.",
        "Illustration of a woven basket with stakes angled outwards.",
        "Illustration of trimmed stakes and glue application on the basket rim.",
        "Illustration of a braided thread for the basket border.",
        "Illustration of wire being wrapped with thread for the handle.",
        "Illustration of a handle being attached to the basket.",
        "Illustration of a finished log basket with a handle."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 33,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Plates",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "aluminium dinner plates",
              "quantity": "13/16in diameter",
              "dimensions": "13/16in diameter",
              "color": "any"
            },
            {
              "item": "Water-slide transfers (decals)",
              "quantity": "1 sheet",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "White or cream enamel spray paints",
              "quantity": "1 can",
              "dimensions": "any",
              "color": "white or cream"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle",
              "dimensions": "any",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "Needle",
              "purpose": "Threading ribbon",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Spray an aluminium plate front and back with enamel spray paint. Trim excess paper from around the transfer and then soak in a dish of water for several minutes until the transfer separates from the paper backing.",
              "technique": "spray painting, soaking",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a plate being sprayed, a transfer being trimmed, and a transfer soaking in water."
            },
            {
              "step_number": 2,
              "instruction": "Rub a small amount of tacky glue over the middle of the plate and place the transfer centrally on the plate, smoothing out any air bubbles. Once dry, cover the plate with diluted tacky glue to cover and conceal the edge of the transfer.",
              "technique": "gluing, smoothing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a transfer being applied to a plate with glue, and then a plate covered with glue."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Decorated plates with water-slide transfers."
        },
        {
          "name": "Ribbon Plates",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "paper dinner plates",
              "quantity": "1",
              "dimensions": "13/16in diameter",
              "color": "any"
            },
            {
              "item": "Water-slide transfers (decals)",
              "quantity": "1 sheet",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "White or cream enamel spray paints",
              "quantity": "1 can",
              "dimensions": "any",
              "color": "white or cream"
            },
            {
              "item": "1/16in diameter circle paper punch",
              "quantity": "1",
              "dimensions": "1/16in diameter",
              "color": "any"
            },
            {
              "item": "2mm width silk ribbon",
              "quantity": "1 length",
              "dimensions": "2mm width",
              "color": "any"
            },
            {
              "item": "Needle",
              "quantity": "1",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle",
              "dimensions": "any",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "1/16in paper punch",
              "purpose": "Punching holes",
              "optional": false
            },
            {
              "name": "Needle",
              "purpose": "Threading ribbon",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a paper plate and use a 1/16in paper punch to pierce an even number of holes around the border. The plate shown here has twenty holes, with a gap of approximately 1/16in between each. Paint the front and back of the plate with enamel spray paint.",
              "technique": "punching, painting",
              "dimensions_mentioned": [
                "1/16in",
                "twenty holes",
                "1/16in"
              ],
              "visual_description": "Image shows a paper plate with holes punched around the border, and a plate being painted."
            },
            {
              "step_number": 2,
              "instruction": "Follow the instructions in steps 1 and 2 from the basic plate above to apply and cover the transfer. Thread the ribbon in and out of the holes on the plate using a needle. Trim each end of the ribbon and glue to the back of the plate.",
              "technique": "applying transfers, threading ribbon, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows ribbon being threaded through holes on a plate, and the ends of the ribbon being glued to the back."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Paper plates decorated with transfers and ribbon threaded through punched holes."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image showing two small decorative plates with floral transfers.",
        "Image showing a plain aluminium plate and a plate with a floral transfer applied.",
        "Image showing a plain aluminium plate and a plate with a floral transfer applied.",
        "Image showing three paper plates with punched holes around the edges, in various stages of completion.",
        "Image showing a needle threading ribbon through the holes of a decorated paper plate."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 34,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Candlesticks and Snuffer",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "brass eyelets",
              "quantity": "2",
              "dimensions": "3mm",
              "color": "brass"
            },
            {
              "item": "gold-plated spacer beads",
              "quantity": "2",
              "dimensions": "6mm x 3mm",
              "color": "gold-plated"
            },
            {
              "item": "slim white cake candle",
              "quantity": "1",
              "dimensions": null,
              "color": "white"
            },
            {
              "item": "gold-plated bell cap",
              "quantity": "1",
              "dimensions": null,
              "color": "gold-plated"
            },
            {
              "item": "gold-plated head pin",
              "quantity": "1",
              "dimensions": null,
              "color": "gold-plated"
            },
            {
              "item": "black water-based acrylic paint",
              "quantity": "1",
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "superglue gel",
              "quantity": "1",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a brass eyelet and place it wide side down. Insert a gold-plated spacer bead into the upturned opening of the eyelet using superglue gel to secure it. Repeat the procedure for the second candlestick.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Three brass eyelets and one gold-plated spacer bead are shown. One eyelet has a spacer bead inserted into its opening."
            },
            {
              "step_number": 2,
              "instruction": "Take the candle and cut two 3/4in lengths. To avoid the wax fracturing, roll the candle backwards and forwards whilst using a craft knife to slice through the wax and cut the wick. Remove 1/8in of wax on each candle to reveal the wick and then insert into the holders.",
              "technique": "cutting",
              "dimensions_mentioned": [
                "3/4in",
                "1/8in"
              ],
              "visual_description": "A candle is shown with dashed lines indicating where to cut. Another image shows a candle wick exposed."
            },
            {
              "step_number": 3,
              "instruction": "To achieve the effect of burnt candles, light the candles and let them burn part of the way down. Cut the wick down to size, as it will not have burnt as quickly as the wax, then colour the wick with black water-based acrylic paint.",
              "technique": "painting",
              "dimensions_mentioned": [],
              "visual_description": "Four brass eyelets with candle wicks inserted are shown. Some wicks are longer than others."
            },
            {
              "step_number": 4,
              "instruction": "To make the snuffer, take the gold-plated bell cap and head pin. Cut the head pin to measure 3/4in long and slide the eye of the bell cap along to the end of the head pin, gluing into place with superglue gel.",
              "technique": "gluing",
              "dimensions_mentioned": [
                "3/4in"
              ],
              "visual_description": "A gold-plated head pin and a gold-plated bell cap are shown. Another image shows the bell cap slid onto the head pin."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Candlesticks and a snuffer made from brass eyelets, beads, and candles."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Two small, finished candlesticks decorated with silver tinsel.",
        "A close-up of the materials needed: two brass eyelets, one gold-plated spacer bead, and a gold-plated snuffer component.",
        "A diagram showing the assembly of the candlestick base with a brass eyelet and spacer bead.",
        "A diagram showing the preparation of the candle wick.",
        "A diagram showing the assembly of the snuffer with a bell cap and head pin."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 35,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Decoy Duck",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Cold porcelain modelling paste",
              "quantity": "1",
              "notes": "see page 10"
            },
            {
              "item": "22-gauge florist's stub wire, painted black",
              "quantity": "1"
            },
            {
              "item": "1/8in thick obechi sheet wood",
              "quantity": "1",
              "dimensions": "1/4in x 1/4in"
            },
            {
              "item": "Medium oak water-based wood stain",
              "quantity": "1"
            },
            {
              "item": "Black and cream water-based acrylic paints",
              "quantity": "1"
            },
            {
              "item": "Black enamel paint",
              "quantity": "1"
            },
            {
              "item": "Tacky glue",
              "quantity": "1"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the cold porcelain modelling paste and roll out a 3/8in diameter ball. Simply shape the ball into the body of a duck. Roll out a 1/4in diameter ball for the head and a 1/16in ball and shape into a beak.",
              "dimensions_mentioned": [
                "3/8in diameter",
                "1/4in diameter",
                "1/16in"
              ],
              "visual_description": "Three small balls of modelling paste, one larger than the others, and a very small one shaped into a beak."
            },
            {
              "step_number": 2,
              "instruction": "Attach the head and beak to the duck's body using a dab of tacky glue. Cut the stub wire to measure 1in long and insert into the base of the duck. Place the opposite end of the wire into a temporary holder, such as florist's foam, until the duck is dry and firm.",
              "dimensions_mentioned": [
                "1in long"
              ],
              "visual_description": "A duck body with a head and beak attached, with a piece of wire inserted into the base and the other end stuck into a block of foam."
            },
            {
              "step_number": 3,
              "instruction": "Cover the duck with a light coat of medium oak wood stain. Once dry, lightly cover the top of the head, body and beak with black acrylic paint. Use a fine paintbrush to stroke cream paint over side of the face and breast. Use black enamel for the eyes.",
              "visual_description": "A finished decoy duck with a brown body, black accents on the head and back, and cream paint on the face and breast. The eyes are black dots."
            },
            {
              "step_number": 4,
              "instruction": "To make the stand, drill a 3/64in hole in the centre of the wooden block. Sand the block and then paint with black acrylic paint. Follow the paint distressing instructions on page 12 to age and add character to the stand. To finish, glue the wire into the wooden block.",
              "dimensions_mentioned": [
                "3/64in hole"
              ],
              "visual_description": "Four small wooden blocks, one with a hole drilled in the center, and a finished decoy duck standing on a block."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A carved wooden decoy duck mounted on a small wooden block."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A small, finished decoy duck on a stand.",
        "Three small, unpainted duck bodies and a beak.",
        "A block of foam with a wire inserted into it, with a decoy duck attached to the wire.",
        "A finished decoy duck with a brown body, black accents, and cream highlights.",
        "Four small wooden blocks, one with a hole drilled in the center, and a finished decoy duck standing on a block.",
        "A silhouette of a duck on a stake.",
        "Three small decoy ducks standing on a block of foam."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 36,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A miniature scene depicting a Victorian entryway with red textured wallpaper, a dark wooden door with a stained-glass panel featuring a Celtic knot design in yellow, red, and green. To the left, a wall sconce with a frosted glass shade and brass base, and a framed picture above a small wooden stand holding a potted plant in a purple pot. To the right, a coat rack with a hat and a dark coat hanging, a wall sconce, and several framed pictures. In the foreground, a wooden stand holding various canes and umbrellas, with a black handbag on the floor. The floor is tiled with a geometric pattern. The title 'Victorian Values' is printed below the scene."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 37,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Hat and Coat Rack",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "obechi thick sheet wood",
              "quantity": "1 piece",
              "dimensions": "3/32in",
              "purpose": "sides"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1 piece",
              "dimensions": "3/8in x 1/8in",
              "length": "2 1/2in",
              "purpose": "hook support"
            },
            {
              "item": "obechi strip wood",
              "quantity": "1 piece",
              "dimensions": "1/8in x 1/16in",
              "length": "2 1/2in",
              "purpose": "back support"
            },
            {
              "item": "obechi strip wood",
              "quantity": "5 pieces",
              "dimensions": "2 7/8in",
              "purpose": "slats"
            },
            {
              "item": "wooden belaying pins",
              "quantity": "3",
              "dimensions": "14mm",
              "purpose": "hooks"
            },
            {
              "item": "Dark wood stain or shoe polish",
              "quantity": "1",
              "purpose": "finish"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "purpose": "adhesive"
            }
          ],
          "tools": [
            {
              "name": "mitre cutters",
              "purpose": "cutting wood",
              "optional": false
            },
            {
              "name": "craft knife",
              "purpose": "cutting wood",
              "optional": false
            },
            {
              "name": "fine-grade sandpaper",
              "purpose": "smoothing edges",
              "optional": false
            },
            {
              "name": "1/16in drill bit",
              "purpose": "drilling holes",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Transfer the coat and hat rack side template on page 62 on to the two pieces of sheet wood and use mitre cutters or a craft knife to remove excess wood. Sand the edges smooth using fine-grade sandpaper. Sand the strip wood pieces too.",
              "technique": "cutting, sanding",
              "dimensions_mentioned": [],
              "visual_description": "Two triangular pieces of wood, representing the sides of the rack."
            },
            {
              "step_number": 2,
              "instruction": "Take the hook support and transfer the drill hole positions from the template on page 62 on to the wood piece. Use a 1/16in drill bit to drill the holes part-way through the wood. Use a dark-coloured wood stain or shoe polish on all of the wooden components.",
              "technique": "drilling, staining/polishing",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "Two pieces of wood strip with pre-drilled holes, showing the positions for the hooks."
            },
            {
              "step_number": 3,
              "instruction": "Remove part of the straight section of wood from the belaying pins using mitre cutters, leaving 1/16in attached to the turned head. Glue the straight ends of the belaying pins into the holes on the hook support.",
              "technique": "cutting, gluing",
              "dimensions_mentioned": [
                "1/16in"
              ],
              "visual_description": "Four wooden belaying pins, with a portion of the straight section removed, ready to be inserted into a wooden strip."
            },
            {
              "step_number": 4,
              "instruction": "Position and glue the hook support and back support between the two sides and leave to dry. Referring to the main photograph at the top of the page, glue two slats on top of the rack, in line with the back and front, and the other three slats in between.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A partially assembled hat and coat rack, showing the sides, hook support, and back support glued together. The slats are yet to be attached."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A wooden hat and coat rack with three hooks."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "coat and hat rack side template",
          "scale": null,
          "shape_description": "Template for the side pieces of the hat and coat rack."
        },
        {
          "name": "hook support template",
          "scale": null,
          "shape_description": "Template showing drill hole positions for the hook support."
        }
      ],
      "diagram_descriptions": [
        "A finished wooden hat and coat rack with a top shelf and three hooks.",
        "Two triangular pieces of wood, representing the sides of the rack.",
        "Two pieces of wood strip with pre-drilled holes, showing the positions for the hooks.",
        "Four wooden belaying pins, with a portion of the straight section removed, ready to be inserted into a wooden strip.",
        "A partially assembled hat and coat rack, showing the sides, hook support, and back support glued together. The slats are yet to be attached."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 38,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Boater",
          "category": "textile",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Canvas (suit interlining)",
              "quantity": "1 piece",
              "dimensions": "2 1/2in x 2 1/2in",
              "color": "any"
            },
            {
              "item": "Hat block",
              "quantity": "1",
              "dimensions": "approx. 3/4in diameter",
              "color": "any"
            },
            {
              "item": "Small elastic band",
              "quantity": "1",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "3mm width black silk ribbon",
              "quantity": "1 length",
              "dimensions": "any",
              "color": "black"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "dimensions": "any",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "Hat block",
              "purpose": "moulding the crown",
              "optional": false
            },
            {
              "name": "Elastic band",
              "purpose": "holding soaked canvas in place",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "The crown of the boater is made by moulding the canvas over a hat block, such as a bottle top or wooden dowel measuring approximately 3/4in diameter. Cut a piece of canvas 2 1/2in x 2 1/2in and soak in warm water for a minute.",
              "technique": "moulding",
              "dimensions_mentioned": [
                "3/4in diameter",
                "2 1/2in x 2 1/2in"
              ],
              "visual_description": "A clear cylindrical object, possibly a bottle top or dowel, with a circular opening at the top."
            },
            {
              "step_number": 2,
              "instruction": "Place the soaked canvas around the top of the mould and hold in place with a small elastic band. Manipulate the material until the canvas on top of the mould is flat and the outside, above the elastic band, is smooth. Once totally dry, remove and trim to measure 1/4in high.",
              "technique": "moulding, trimming",
              "dimensions_mentioned": [
                "1/4in high"
              ],
              "visual_description": "A piece of fabric, held in place by a red elastic band, is moulded around a cylindrical object. A separate circular piece of fabric is shown next to it."
            },
            {
              "step_number": 3,
              "instruction": "Cover a 1 1/2in x 1 1/2in piece of canvas on one side with diluted tacky glue and leave to dry. Draw a 1 3/8in diameter circle on the glued side (underside) of the canvas, followed by a circle in the centre slightly smaller than the size of the crown and cut out.",
              "technique": "cutting",
              "dimensions_mentioned": [
                "1 1/2in x 1 1/2in",
                "1 3/8in diameter"
              ],
              "visual_description": "Two circular pieces of fabric. One is a solid circle, and the other is a ring shape."
            },
            {
              "step_number": 4,
              "instruction": "Glue the crown on to the brim, with the glued side downwards. Trim the boater with a length of 3mm black silk ribbon. Make a bow as described on page 54, remove the ends and then flatten and glue it on, to cover the join in the ribbon band.",
              "technique": "gluing, trimming, bow-making",
              "dimensions_mentioned": [
                "3mm"
              ],
              "visual_description": "A finished boater hat with a dark ribbon band and a small bow. A separate small black bow is shown next to the hat."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Felt or leather may be used as alternative materials."
          ],
          "finished_product_description": "A miniature boater hat made from canvas, with a ribbon band and bow."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A small, finished boater hat with a dark ribbon band and bow.",
        "A clear cylindrical object, possibly a bottle top or dowel, used as a mould.",
        "A piece of fabric, held in place by a red elastic band, being moulded around a cylindrical object. A separate circular piece of fabric is shown next to it.",
        "Two circular pieces of fabric. One is a solid circle, and the other is a ring shape.",
        "A finished boater hat with a dark ribbon band and a small bow. A separate small black bow is shown next to the hat."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 39,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Stick Stand",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "thick card",
              "quantity": "1 piece",
              "dimensions": "13/32in x 7/8in",
              "color": "any"
            },
            {
              "item": "obechi strip wood",
              "quantity": "4 lengths",
              "dimensions": "21/2in",
              "purpose": "legs"
            },
            {
              "item": "obechi strip wood",
              "quantity": "4 lengths",
              "dimensions": "15/8in",
              "purpose": "front and back supports"
            },
            {
              "item": "obechi strip wood",
              "quantity": "6 lengths",
              "dimensions": "3/4in",
              "purpose": "side and middle supports"
            },
            {
              "item": "obechi sheet wood",
              "quantity": "1 piece",
              "dimensions": "13/32in x 3/16in",
              "color": "any"
            },
            {
              "item": "Dark wood stain or shoe polish",
              "quantity": "1",
              "color": "any"
            },
            {
              "item": "Black and silver water-based acrylic paints",
              "quantity": "1",
              "color": "any"
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "gluing jig",
              "purpose": "holding pieces at right angles",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Transfer the tray measurements from the template on page 62 on to the thick card and cut out. Paint the card with a mixture of black and silver acrylic paint to give the effect of a metallic tray base. Once dry, repeat the procedure on the other side of the card.",
              "technique": "cutting, painting",
              "dimensions_mentioned": [],
              "visual_description": "A dark rectangular shape with a stepped edge, representing the tray base."
            },
            {
              "step_number": 2,
              "instruction": "Sand and stain or shoe polish the wooden components. Take two legs and on each mark 1/8in along from each end. Place into a right-angled gluing jig (see page 8) and position and glue two front supports between the legs, as shown. Repeat with the remaining legs and back supports.",
              "technique": "sanding, staining, gluing",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "Two wooden legs are shown with two horizontal supports glued between them, forming a rectangular frame. A second image shows a similar frame, but with two additional supports creating a divided tray base."
            },
            {
              "step_number": 3,
              "instruction": "Place the front and back sections into the gluing jig and glue the two side supports between, as shown. Once dry, position and glue two supports centrally into the stand and the remaining ones on to the opposite side.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A partially assembled stick stand frame is shown, with side supports being glued between the front and back sections. A second image shows the frame with additional central supports being added."
            },
            {
              "step_number": 4,
              "instruction": "Position and glue the tray underneath the stand. To complete, glue the squares of sheet wood on top of the legs.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A completed stick stand is shown from a top-down perspective, with the tray base glued in place and small squares of wood glued to the top of the legs."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A miniature wooden stick stand with a divided tray base."
        }
      ],
      "tools_reference": [
        {
          "name": "gluing jig",
          "use": "To hold components at right angles for gluing",
          "suitable_for": [
            "woodworking",
            "model making"
          ]
        }
      ],
      "templates": [
        {
          "name": "Tray Template",
          "scale": "See page 62",
          "shape_description": "A rectangular shape with stepped edges, used for the tray base."
        }
      ],
      "diagram_descriptions": [
        "A large, dark wooden stick stand with four legs and a divided tray base.",
        "A close-up of the tray base, showing its stepped rectangular shape.",
        "A close-up of the wooden components of the stick stand, showing the legs and supports.",
        "A partially assembled stick stand frame, showing the attachment of side supports.",
        "A partially assembled stick stand frame, showing the attachment of central supports.",
        "A completed stick stand from a top-down perspective, showing the tray and top squares.",
        "A smaller, finished stick stand with canes inside, illustrating a variation."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 40,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Silver-topped Stick",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "hardwood dowel",
              "quantity": "two",
              "dimensions": "1/16in diameter, 3in lengths",
              "color": null
            },
            {
              "item": "aluminium foil",
              "quantity": "five pieces",
              "dimensions": "5/16in x 1/16in",
              "color": null
            },
            {
              "item": "round silver bead",
              "quantity": "4mm",
              "dimensions": null,
              "color": "silver"
            },
            {
              "item": "round black bead",
              "quantity": "4mm",
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "Centre (reed) cane",
              "quantity": "size 3",
              "dimensions": "5in length",
              "color": null
            },
            {
              "item": "black enamel paint",
              "quantity": null,
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "silver water-based acrylic paint",
              "quantity": null,
              "dimensions": null,
              "color": "silver"
            },
            {
              "item": "wood stain or shoe polish",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Stain or shoe polish a length of dowel. Shave one end and glue on a silver bead. Wind a length of aluminium foil around the shaft below the bead and glue in place for a collar. Repeat with another piece of foil to make a ferrule (tip) and glue into place. Touch up each end of the stick with silver acrylic paint.",
              "technique": "staining, gluing, painting",
              "dimensions_mentioned": [],
              "visual_description": "Diagram showing two dowel pieces, one with a bead and foil collar, the other with a bead and foil ferrule."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A walking stick with a silver bead and foil decoration at the top and a ferrule at the bottom."
        },
        {
          "name": "Ebony Stick",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "dowel",
              "quantity": "one length",
              "dimensions": null,
              "color": null
            },
            {
              "item": "black enamel paint",
              "quantity": null,
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "black bead",
              "quantity": "one",
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "wood stain or shoe polish",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a length of dowel and paint with black enamel paint. Once dry, make a knob (using a black bead), collar and ferrule for the stick, as described left.",
              "technique": "painting, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Diagram showing a black dowel with a bead at one end and a ferrule at the other."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A walking stick painted black with a bead knob and ferrule."
        },
        {
          "name": "Curved-handled Stick",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Centre cane",
              "quantity": "size 3",
              "dimensions": "5in length",
              "color": null
            },
            {
              "item": "wood stain or shoe polish",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "pencil",
              "purpose": "bending aid",
              "optional": false
            },
            {
              "name": "clothes peg",
              "purpose": "holding bent cane",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Soak a 5in length of size 3 centre cane in warm water for 20 minutes and then bend one end over a pencil. Hold in place with a clothes peg and straighten the opposite end. Once dry, trim the handle and stick to 3 1/8in. Make a ferrule, as described above.",
              "technique": "soaking, bending, trimming",
              "dimensions_mentioned": [
                "5in",
                "3 1/8in"
              ],
              "visual_description": "Diagram showing a cane bent over a pencil with a clothes peg holding it in place."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A walking stick with a curved handle and a ferrule."
        },
        {
          "name": "Variation: Porcelain Knobs",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "porcelain or opaque glass bead",
              "quantity": "one",
              "dimensions": null,
              "color": null
            },
            {
              "item": "28-gauge wire",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "gold foil",
              "quantity": null,
              "dimensions": null,
              "color": "gold"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Follow the instructions for the silver-topped stick but replace the silver bead with a porcelain or opaque glass bead. Wind 28-gauge wire immediately below the bead as an alternative collar. Gold foil is available from craft shops and can be used as an alternative to aluminium foil.",
              "technique": "wrapping, decorating",
              "dimensions_mentioned": [],
              "visual_description": "Diagram showing several walking sticks with different colored bead tops and wire collars."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Walking sticks decorated with porcelain or glass beads and wire collars."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image of three walking sticks: one with a silver top, one black, and one with a curved handle.",
        "Diagram showing the components for a silver-topped stick: dowel, bead, foil collar, and ferrule.",
        "Diagram showing the components for an ebony stick: dowel, bead, and ferrule.",
        "Diagram showing a cane being bent over a pencil with a clothes peg.",
        "Image of a wooden stand holding several walking sticks with various decorative tops.",
        "Image of several walking sticks with different colored bead tops and wire collars."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 41,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Plant Stand",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "obechi sheet wood",
              "quantity": "1 piece",
              "dimensions": "3/32in thick",
              "color": null
            },
            {
              "item": "spindle",
              "quantity": "2",
              "dimensions": "1in x 1in",
              "color": null
            },
            {
              "item": "Round-ended spindle",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Dark wood stain or shoe polish",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "pencil",
              "purpose": "marking",
              "optional": false
            },
            {
              "name": "ruler",
              "purpose": "marking",
              "optional": false
            },
            {
              "name": "mitre cutters or a craft knife",
              "purpose": "cutting wood",
              "optional": false
            },
            {
              "name": "fine-grade sandpaper",
              "purpose": "chamfering edges",
              "optional": false
            },
            {
              "name": "drill bit",
              "purpose": "drilling holes",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a wood piece and use a pencil and ruler to draw a line from corner to corner to find the centre. Measure and mark 3/16in along from each corner then join the marks using a pencil and ruler.",
              "technique": "marking",
              "dimensions_mentioned": [
                "3/16in"
              ],
              "visual_description": "Two square wood pieces with diagonal lines drawn from corner to corner, and marks along the edges."
            },
            {
              "step_number": 2,
              "instruction": "Remove the corner sections using either mitre cutters or a craft knife. Chamfer the edges of the wood piece, on the side without the pencil marks, to an angle of 45 degrees using fine-grade sandpaper (see Basic Techniques page 12). Repeat steps 1 and 2 with the second piece of wood.",
              "technique": "cutting, chamfering",
              "dimensions_mentioned": [
                "45 degrees"
              ],
              "visual_description": "Two octagonal wood pieces, one with a central hole, the other with a partial hole."
            },
            {
              "step_number": 3,
              "instruction": "Measure the diameter of the wide end of your spindle and using the same sized drill bit, drill a hole centrally straight through a wood piece for the base. On the second piece, drill a hole the same size but only half way through for the top.",
              "technique": "drilling",
              "dimensions_mentioned": [],
              "visual_description": "Two octagonal wood pieces, one with a central hole, the other with a partial hole."
            },
            {
              "step_number": 4,
              "instruction": "Cut the narrow end off the spindle and sand smooth. Stain or shoe polish all the wooden components. Glue the straight end of the spindle into the base, chamfered side up. Glue the top into position, with the wood grain of both pieces in line with the base.",
              "technique": "cutting, sanding, staining, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Two turned wooden spindles, one with a wider end and a narrower end, the other with both ends turned."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "For a more contemporary look make a plant stand as described above but decorate it with a distressed paint finish in cream or a colour to complement your dolls' house décor (see page 12 for distressing technique instructions)."
          ],
          "finished_product_description": "A small, turned wooden plant stand with a hexagonal base and top, and a turned central column with decorative rings."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A finished wooden plant stand with a hexagonal base and top, and a turned central column with decorative rings.",
        "Four diagrams illustrating steps 1 and 2: a square piece of wood with diagonal lines and marks, two octagonal pieces of wood with central markings, and two turned wooden spindles.",
        "A photograph of a plant stand with a plant on top, showing a variation with a distressed paint finish."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 42,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Aspidistra",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Leaf green floral tape",
              "quantity": "1 roll",
              "dimensions": null,
              "color": "leaf green"
            },
            {
              "item": "26-gauge green paper-covered floral wire",
              "quantity": "12 lengths",
              "dimensions": "2 1/2in",
              "color": "green"
            },
            {
              "item": "Dry tea leaves",
              "quantity": "sufficient amount",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Plant pot",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": "sufficient amount",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Cut twelve strips of floral tape into varying lengths ranging from 2 1/2in to 1 1/2in. Take a piece of floral tape and cover one half of the tape on one side with a thin layer of tacky glue. Place the wire centrally on the glued section of the tape, as shown.",
              "technique": "cutting, gluing",
              "dimensions_mentioned": [
                "2 1/2in",
                "1 1/2in"
              ],
              "visual_description": "Two rectangular strips of floral tape with a thin wire placed centrally on one half of each strip."
            },
            {
              "step_number": 2,
              "instruction": "Fold the tape over, so the wire is sandwiched between the tape. Press firmly, then slightly pull the end of the wire so the wire isn't right at the end of the fold. Repeat the procedure with the remaining materials and leave to dry.",
              "technique": "folding, pressing",
              "dimensions_mentioned": [],
              "visual_description": "A folded piece of floral tape with a wire inside, showing the wire slightly pulled from the end. A small pot filled with many green stems is shown to the right."
            },
            {
              "step_number": 3,
              "instruction": "Transfer the leaf template from page 61 on to the longest floral tape pieces. Alter the length and width of the leaf accordingly and cut out the shapes. Trim the wire ends to 1in. Make soil by mixing dry tea leaves with tacky glue and press into your plant pot.",
              "technique": "transferring, cutting, mixing, pressing",
              "dimensions_mentioned": [
                "1in"
              ],
              "visual_description": "Two leaf shapes cut from floral tape, one longer than the other, each with a wire extending from the base. A small pot filled with soil made from tea leaves is shown below."
            },
            {
              "step_number": 4,
              "instruction": "Immediately position the leaves into the pot starting with the smallest in the centre and working outwards and leaving the stems visible. Once the soil has dried out, refer to the main photograph and bend the leaves into position.",
              "technique": "positioning, bending",
              "dimensions_mentioned": [],
              "visual_description": "A small pot with several green leaves positioned in the soil, with stems visible. The finished Aspidistra plant is shown to the right."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Paint a fine line of antique white acrylic paint centrally along each side of the tape before it dries to give a variegated effect to the leaf."
          ],
          "finished_product_description": "A miniature Aspidistra houseplant made from floral tape and wire, planted in a small pot with a soil made from tea leaves."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Leaf template",
          "scale": null,
          "shape_description": "A template for cutting leaf shapes from floral tape, with varying lengths and widths."
        }
      ],
      "diagram_descriptions": [
        "Diagram showing two pieces of floral tape with wires attached, illustrating step 1.",
        "Diagram showing a folded piece of floral tape with a wire, illustrating step 2.",
        "Diagram showing two cut leaf shapes from floral tape with wires, illustrating step 3.",
        "Photograph of a finished miniature Aspidistra plant in a pot.",
        "Photograph of a potted Aspidistra plant with many leaves."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 43,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Framed Photographs",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "White card for colour photocopying",
              "quantity": "1 piece"
            },
            {
              "item": "Neutral-coloured paper for mounts",
              "quantity": "1 piece"
            },
            {
              "item": "Paper punches",
              "quantity": "1 set",
              "details": [
                "1.5cm diameter circle",
                "1cm diameter circle",
                "1cm square",
                "1.3cm x 0.7cm rectangle"
              ]
            },
            {
              "item": "Jutong strip wood",
              "quantity": "3 pieces",
              "dimensions": [
                "1/8in x 1/16in",
                "3/32in x 1/16in",
                "1/16in x 1/16in"
              ]
            },
            {
              "item": "Wood stain",
              "quantity": "1 bottle"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Colour photocopy the sepia prints on page 61 onto white card. Use paper punches to punch holes out of the coloured paper to make a mount for each of the photographs, ensuring that the aperture is no larger than the photograph.",
              "technique": "photocopying, punching",
              "dimensions_mentioned": [
                "1.5cm diameter circle",
                "1cm diameter circle",
                "1cm square",
                "1.3cm x 0.7cm rectangle"
              ],
              "visual_description": "A piece of light green card with various shapes punched out (circles, square, rectangle) and several small sepia photographs placed on top."
            },
            {
              "step_number": 2,
              "instruction": "Cut out the photographs, leaving a small border around the outside. Cut the mounts to size, leaving no more than 1/4in border around the aperture. Position and glue the photograph to the back of the mount.",
              "technique": "cutting, gluing",
              "dimensions_mentioned": [
                "1/4in"
              ],
              "visual_description": "A small framed photograph with a sepia image of a man and woman inside a mount with a circular aperture."
            },
            {
              "step_number": 3,
              "instruction": "Stain the lengths of strip wood and then make a frame for each photograph (see page 12). The frame should measure slightly larger than the outside edges of the mount. Alternatively, use moulded picture framing wood to frame the photographs.",
              "technique": "staining, framing",
              "dimensions_mentioned": [
                "1/8in x 1/16in",
                "3/32in x 1/16in",
                "1/16in x 1/16in"
              ],
              "visual_description": "A small square frame with a square mount inside, showing a sepia photograph of a group of people."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Make small photograph frames out of metal frames used for egg decorating. They can be sprayed and antiqued (see tip on page 28), tarnished using wood stain or left in their natural state. Cut a photograph to fit and glue into position. Make a stand for the frame by folding a small strip of card into a V shape and gluing it to the back of the frame."
          ],
          "finished_product_description": "Miniature framed photographs in various styles and sizes, some with ornate frames."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A collection of small, ornate, gold-colored frames, some containing sepia photographs.",
        "A miniature wooden table with several small framed photographs and decorative items on top.",
        "A light green card with various shapes punched out (circles, square, rectangle) and several small sepia photographs placed on top.",
        "A small framed photograph with a sepia image of a man and woman inside a mount with a circular aperture.",
        "A small square frame with a square mount inside, showing a sepia photograph of a group of people.",
        "A small framed photograph with a sepia image of a man in a suit inside a rectangular mount.",
        "A small framed photograph with a sepia image of two people inside a square mount.",
        "A small framed photograph with a sepia image of a group of people inside a square mount."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 44,
    "extracted": {
      "page_type": "introduction",
      "projects": [
        {
          "name": "Decorative Bottles and Jars",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "glass and ceramic beads",
              "quantity": "small selection",
              "dimensions": "no larger than 1cm",
              "color": "any"
            },
            {
              "item": "brass knobs",
              "quantity": "small selection",
              "dimensions": "3mm and 2mm diameter",
              "color": "any"
            },
            {
              "item": "gold-plated decorative caps",
              "quantity": "small selection",
              "dimensions": "6mm diameter",
              "color": "gold-plated"
            },
            {
              "item": "silver-plated up-eye",
              "quantity": "small selection",
              "dimensions": "10mm",
              "color": "silver-plated"
            },
            {
              "item": "gold-plated up-eye",
              "quantity": "small selection",
              "dimensions": "8mm",
              "color": "gold-plated"
            },
            {
              "item": "silver-plated up-eye",
              "quantity": "small selection",
              "dimensions": "6mm",
              "color": "silver-plated"
            },
            {
              "item": "gold-plated bead cap",
              "quantity": "small selection",
              "dimensions": "8mm high",
              "color": "gold-plated"
            },
            {
              "item": "nickel eyelets",
              "quantity": "small selection",
              "dimensions": "3mm",
              "color": "nickel"
            },
            {
              "item": "gold-plated bell",
              "quantity": "small selection",
              "dimensions": "7mm high",
              "color": "gold-plated"
            },
            {
              "item": "wooden belaying pin",
              "quantity": "small selection",
              "dimensions": "14mm",
              "color": "wooden"
            },
            {
              "item": "enamel paints",
              "quantity": "small selection",
              "color": "any"
            },
            {
              "item": "wood stain",
              "quantity": "small selection",
              "color": "any"
            },
            {
              "item": "superglue gel",
              "quantity": "small selection",
              "color": "any"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Make decorative bottles and jars with glass and ceramic beads which have brass knobs or 2mm diameter up-eyes inserted.",
              "technique": "assembly",
              "dimensions_mentioned": [
                "2mm diameter"
              ],
              "visual_description": "Several glass and ceramic beads, some with brass knobs and some with up-eyes inserted, are shown. One bead is amber colored and appears to be a bottle shape. Another is black and appears to be a jar shape. There are also small brass knob and up-eye findings."
            },
            {
              "step_number": 2,
              "instruction": "An interesting display of bottles can be made using a variety of different sized and shaped beads and up-eyes.",
              "technique": "display",
              "dimensions_mentioned": [],
              "visual_description": "The image shows a variety of beads and findings that can be used to create decorative bottles and jars."
            },
            {
              "step_number": 3,
              "instruction": "Gold plated up-eyes are also available.",
              "technique": "information",
              "dimensions_mentioned": [],
              "visual_description": "The image shows various beads and findings, including gold-plated up-eyes."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Decorative bottles and jars made from beads and findings."
        },
        {
          "name": "Lidded Pots",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "glass and ceramic beads",
              "quantity": "small selection",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "gold-plated decorative caps",
              "quantity": "small selection",
              "dimensions": "6mm diameter",
              "color": "gold-plated"
            },
            {
              "item": "enamel paint",
              "quantity": "small selection",
              "color": "any"
            },
            {
              "item": "cocktail stick",
              "quantity": "small selection",
              "color": "any"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Make lidded pots from glass and ceramic beads topped with 6mm gold-plated decorative caps.",
              "technique": "assembly",
              "dimensions_mentioned": [
                "6mm diameter"
              ],
              "visual_description": "Several glass and ceramic beads are shown, some topped with gold-plated decorative caps. One bead is purple with a floral design, another is green. The caps have raised patterns."
            },
            {
              "step_number": 2,
              "instruction": "The relief pattern on some caps enables them to be enamelled.",
              "technique": "decoration",
              "dimensions_mentioned": [],
              "visual_description": "Close-up of a gold-plated cap showing a relief pattern that can be filled with enamel."
            },
            {
              "step_number": 3,
              "instruction": "Dip a cocktail stick into enamel paint and allow a small droplet to fall into the area to be decorated.",
              "technique": "enamelling",
              "dimensions_mentioned": [],
              "visual_description": "A cocktail stick is shown being dipped into a small pot of paint."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Small lidded pots made from beads and decorative caps."
        },
        {
          "name": "Trinket Dishes",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "nickel eyelets",
              "quantity": "small selection",
              "dimensions": "any",
              "color": "nickel"
            },
            {
              "item": "up-eyes",
              "quantity": "small selection",
              "dimensions": "10mm",
              "color": "any"
            },
            {
              "item": "bead cap",
              "quantity": "small selection",
              "dimensions": "8mm diameter",
              "color": "any"
            },
            {
              "item": "up-eye",
              "quantity": "small selection",
              "dimensions": "6mm",
              "color": "any"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Make dishes from nickel eyelets with 10mm up-eyes inserted into the narrow end.",
              "technique": "assembly",
              "dimensions_mentioned": [
                "10mm"
              ],
              "visual_description": "Several nickel eyelets are shown, some with 10mm up-eyes inserted into their narrow ends. These are arranged to resemble small dishes."
            },
            {
              "step_number": 2,
              "instruction": "Make a decorative pot using an 8mm diameter bead cap, topped with a 6mm up-eye.",
              "technique": "assembly",
              "dimensions_mentioned": [
                "8mm diameter",
                "6mm"
              ],
              "visual_description": "An 8mm diameter bead cap is shown, with a 6mm up-eye attached to its top, forming a small decorative pot."
            },
            {
              "step_number": 3,
              "instruction": "Make a trinket pot from an eyelet, capped with a 6mm up-eye.",
              "technique": "assembly",
              "dimensions_mentioned": [
                "6mm"
              ],
              "visual_description": "A nickel eyelet is shown, capped with a 6mm up-eye, forming a trinket pot."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Small trinket dishes and decorative pots made from eyelets and beads."
        },
        {
          "name": "Bells",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "bell",
              "quantity": "small selection",
              "dimensions": "any",
              "color": "any"
            },
            {
              "item": "pliers",
              "quantity": "small pair",
              "color": "any"
            },
            {
              "item": "wooden belaying pin",
              "quantity": "small selection",
              "dimensions": "14mm",
              "color": "wooden"
            },
            {
              "item": "wood stain",
              "quantity": "small selection",
              "color": "any"
            },
            {
              "item": "glue",
              "quantity": "small selection",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "pliers",
              "purpose": "to remove clapper and trim wood",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the bell and remove the clapper using a small pair of pliers.",
              "technique": "disassembly",
              "dimensions_mentioned": [],
              "visual_description": "A small bell is shown. A pair of pliers is indicated as the tool to remove the clapper."
            },
            {
              "step_number": 2,
              "instruction": "Remove part of the straight section of the wood from a 14mm belaying pin, leaving 1/8in attached to the turned head.",
              "technique": "cutting",
              "dimensions_mentioned": [
                "14mm",
                "1/8in"
              ],
              "visual_description": "A 14mm wooden belaying pin is shown. A section of the straight part is indicated to be removed, leaving a small portion attached to the head."
            },
            {
              "step_number": 3,
              "instruction": "Stain and then glue this into the top of the bell.",
              "technique": "assembly and finishing",
              "dimensions_mentioned": [],
              "visual_description": "The prepared wooden piece is shown being glued into the top opening of the bell."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Decorative bells made from existing bells and wooden pins."
        },
        {
          "name": "Variation: Pot-pourri Dishes",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "no-hole beads",
              "quantity": "small selection",
              "dimensions": "1mm diameter",
              "color": "any"
            },
            {
              "item": "fragments of dried flowers",
              "quantity": "small selection",
              "color": "any"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Dishes can be filled with 1mm diameter no-hole beads to represent bon-bons or with fragments of dried flowers to represent pot-pourri.",
              "technique": "filling",
              "dimensions_mentioned": [
                "1mm diameter"
              ],
              "visual_description": "Two finished decorative dishes are shown. One is filled with small, round, brown beads resembling bon-bons. The other is filled with small, colorful fragments resembling dried flowers for pot-pourri."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "Decorative dishes filled with beads or dried flowers."
        }
      ],
      "tools_reference": [
        {
          "name": "Pliers",
          "use": "To remove clappers from bells and trim small parts.",
          "suitable_for": [
            "metal",
            "wood"
          ]
        }
      ],
      "templates": [],
      "diagram_descriptions": [
        "A collection of various small decorative items including bells, ornate caps, beads, and eyelets, likely for use in crafting trinkets.",
        "A display of beads and findings for making decorative bottles and jars, including amber-colored beads, black beads, brass knobs, and up-eyes.",
        "A display of beads and decorative caps for making lidded pots, including purple and green beads and gold-plated caps with relief patterns.",
        "A display of nickel eyelets and up-eyes for making trinket dishes and decorative pots.",
        "A display of small bells and wooden pin components for making decorative bells.",
        "Two examples of finished decorative dishes, one filled with small beads resembling bon-bons, and the other filled with fragments of dried flowers resembling pot-pourri."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 45,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Bracket Lamps",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "brass tube",
              "quantity": "1",
              "dimensions": "1/16in diameter, two 1 1/4in lengths",
              "color": "brass"
            },
            {
              "item": "gold-plated bells",
              "quantity": "2",
              "dimensions": "5mm high",
              "color": "gold-plated"
            },
            {
              "item": "gold-plated up-eyes",
              "quantity": "2",
              "dimensions": "12mm diameter",
              "color": "gold-plated"
            },
            {
              "item": "frosted flower shades",
              "quantity": "2",
              "dimensions": null,
              "color": "frosted"
            },
            {
              "item": "clear plastic tube",
              "quantity": "1",
              "dimensions": "3/16in diameter, two 1/2in lengths",
              "color": "clear"
            },
            {
              "item": "gold-plated head pins",
              "quantity": "2",
              "dimensions": null,
              "color": "gold-plated"
            },
            {
              "item": "Superglue gel",
              "quantity": "1",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": "1",
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "pliers",
              "purpose": "to remove clappers from bells",
              "optional": false
            },
            {
              "name": "pin file",
              "purpose": "to widen holes",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Transfer the bracket lamp template on page 62 on to paper or card. Take a length of brass tube and with two pairs of small pliers, bend into the shape shown on the drawing. Repeat the procedure with the remaining piece of brass tube.",
              "technique": "bending",
              "dimensions_mentioned": [],
              "visual_description": "A straight brass tube, a bent brass tube in a zig-zag shape, and two small gold-plated bells with a bead and a decorative disc."
            },
            {
              "step_number": 2,
              "instruction": "Use a small pair of pliers to remove the clappers from the bells. Check that the brass tube threads through the holes in the bells, the shades and the loop on each of the up-eyes. If you have difficulty, widen the holes carefully using a pin file.",
              "technique": "assembly",
              "dimensions_mentioned": [],
              "visual_description": "A close-up of a gold-plated bell with its clapper removed, a gold-plated bead, and a decorative gold-plated disc."
            },
            {
              "step_number": 3,
              "instruction": "Thread the bell on to the brass tube, then position the shade on top of the upturned bell, so the end of the brass tube is just visible in the shade. Superglue into place, then repeat with the other lamp.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "A brass tube with a bell threaded onto it, and a frosted shade placed on top of the bell. Another brass tube is shown separately."
            },
            {
              "step_number": 4,
              "instruction": "Use tacky glue to fix the clear plastic tube inside the base of the shade. Slide the brass tube on to the cap - do not glue, to enable the lamp to swing. Cut a head pin to 1/4in and glue into the protruding end of the brass tube. Repeat for the second lamp.",
              "technique": "gluing",
              "dimensions_mentioned": [
                "1/4in"
              ],
              "visual_description": "A partially assembled lamp showing a clear plastic tube inside a shade, a brass tube attached to a cap, and a head pin glued to the end of the brass tube."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A decorative bracket lamp made from brass tubing, bells, and frosted shades."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "bracket lamp template",
          "scale": null,
          "shape_description": "A template for bending brass tube into a zig-zag shape."
        }
      ],
      "diagram_descriptions": [
        "A photograph showing two small, ornate gold-colored findings, possibly decorative caps or embellishments.",
        "A photograph showing a straight piece of brass tubing.",
        "A photograph showing a piece of brass tubing bent into a zig-zag shape.",
        "A photograph showing a small gold-plated bell, a gold-plated bead, and a decorative gold-plated disc.",
        "A photograph showing a brass tube with a bell and a frosted shade attached.",
        "A photograph showing a partially assembled lamp with a clear plastic tube inside a shade, a brass tube, and a head pin."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 46,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Oil Lamp",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "8mm acrylic gold-plated corrugated ring bead",
              "quantity": "1",
              "dimensions": "8mm",
              "color": "gold-plated"
            },
            {
              "item": "Gold-plated head pin",
              "quantity": "1"
            },
            {
              "item": "15mm acrylic gold-plated bead cap",
              "quantity": "1",
              "dimensions": "15mm",
              "color": "gold-plated"
            },
            {
              "item": "25mm x 4mm gold-plated fluted tube bead",
              "quantity": "1",
              "dimensions": "25mm x 4mm",
              "color": "gold-plated"
            },
            {
              "item": "12mm x 6mm acrylic gold-plated cushion bead",
              "quantity": "1",
              "dimensions": "12mm x 6mm",
              "color": "gold-plated"
            },
            {
              "item": "Frosted flower shade",
              "quantity": "1"
            },
            {
              "item": "3/16in diameter clear plastic tube",
              "quantity": "1",
              "dimensions": "3/16in diameter",
              "color": "clear"
            },
            {
              "item": "1/2in length",
              "quantity": "1",
              "dimensions": "1/2in length"
            },
            {
              "item": "12-volt grain-of-rice bulb with fine wires",
              "quantity": "1"
            },
            {
              "item": "Superglue gel",
              "quantity": "1"
            }
          ],
          "tools": [
            {
              "name": "1/32in drill bit",
              "purpose": "drill hole",
              "optional": false
            },
            {
              "name": "1/16in drill bit",
              "purpose": "drill hole",
              "optional": false
            },
            {
              "name": "pliers",
              "purpose": "to slightly lift loops",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Use a 1/32in drill bit to drill a hole part of the way through the side of the corrugated ring bead. Cut the head pin to measure 3/16in and superglue the straight end into the drilled hole. Use a 1/16in drill bit to drill a hole through the side of the bead cap, for electrification.",
              "technique": "drilling, cutting, gluing",
              "dimensions_mentioned": [
                "1/32in",
                "3/16in",
                "1/16in"
              ],
              "visual_description": "Diagram showing a head pin being inserted into a drilled bead, and a bead cap with a drilled hole."
            },
            {
              "step_number": 2,
              "instruction": "Glue the cap, tube and cushion beads together as shown, followed by the corrugated ring and shade. Thread the wires from the bulb down through the shade and out of the hole in the base. Rest the plastic tube in the shade, without gluing to allow replacement of the bulb.",
              "technique": "gluing, threading",
              "dimensions_mentioned": [],
              "visual_description": "Diagram showing the assembled oil lamp base with a bulb and wires threaded through."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A decorative oil lamp made from beads and a frosted flower shade."
        },
        {
          "name": "Tiffany Lamp",
          "category": "other",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Gold-plated filigree shade",
              "quantity": "1",
              "color": "gold-plated"
            },
            {
              "item": "Black spray paint",
              "quantity": "1"
            },
            {
              "item": "Glass paints",
              "quantity": "1"
            },
            {
              "item": "Gold-plated spoke",
              "quantity": "1",
              "color": "gold-plated"
            },
            {
              "item": "25mm x 4mm gold-plated fluted tube bead",
              "quantity": "1",
              "dimensions": "25mm x 4mm",
              "color": "gold-plated"
            },
            {
              "item": "15mm acrylic gold-plated bead cap",
              "quantity": "1",
              "dimensions": "15mm",
              "color": "gold-plated"
            },
            {
              "item": "5mm x 2mm brass washer bead",
              "quantity": "1",
              "dimensions": "5mm x 2mm",
              "color": "brass"
            },
            {
              "item": "12-volt grain-of-wheat bulb with fine wires",
              "quantity": "1"
            }
          ],
          "tools": [
            {
              "name": "cocktail stick",
              "purpose": "dip into glass paint",
              "optional": false
            },
            {
              "name": "pliers",
              "purpose": "to slightly lift loops",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take the filigree shade and lightly spray inside and out with black spray paint. Take a cocktail stick, dip it into the glass paint and begin to fill the gaps in the shade symmetrically, allowing each colour to dry before continuing with the next.",
              "technique": "spray painting, painting",
              "dimensions_mentioned": [],
              "visual_description": "Image showing three filigree shades, one gold, two dark. The dark ones appear to have colored glass filling the gaps."
            },
            {
              "step_number": 2,
              "instruction": "Take the spoke and use pliers to slightly lift the loops at each end. Superglue the lamp stand together, following the oil lamp instructions for electrification details. Rest the shade on top of the upturned spokes – do not glue, to allow easy replacement of the bulb.",
              "technique": "gluing",
              "dimensions_mentioned": [],
              "visual_description": "Diagram showing a gold-plated spoke with loops, and an assembled lamp stand with a bead base and the filigree shade resting on top."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A Tiffany-style table lamp with a decorative filigree shade."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Two finished table lamps, one with a frosted flower shade and the other a Tiffany-style lamp with a filigree shade.",
        "Close-up of components for the oil lamp: a head pin, two small beads, and a larger decorative bead.",
        "Close-up of components for the Tiffany lamp: three filigree shades of different finishes.",
        "Close-up of components for the Tiffany lamp stand: a gold-plated spoke with loops, and a bead base."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 47,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Papier Mâché Letter Rack",
          "category": "mixed_media",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "thickness card",
              "quantity": "1 piece",
              "dimensions": "1/32in",
              "color": null
            },
            {
              "item": "circle paper punch",
              "quantity": "1",
              "dimensions": "1/16in diameter",
              "color": null
            },
            {
              "item": "black water-based enamel paint",
              "quantity": null,
              "dimensions": null,
              "color": "black"
            },
            {
              "item": "water-slide transfers (decals) or acrylic water-based paints",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "gold metallic paste",
              "quantity": null,
              "dimensions": null,
              "color": "gold"
            },
            {
              "item": "tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "sharp craft knife",
              "purpose": "scoring card",
              "optional": false
            },
            {
              "name": "paper punch",
              "purpose": "making hole",
              "optional": false,
              "dimensions": "1/16in diameter"
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Transfer the letter rack templates on page 62 on to a piece of 1/32in thickness card. Use a sharp craft knife to score the card where indicated. Make a hole at the top of the rack using a 1/16in diameter paper punch.",
              "technique": "transferring templates, scoring, punching",
              "dimensions_mentioned": [
                "1/32in",
                "1/16in diameter"
              ],
              "visual_description": "Image shows a piece of card with score lines and a hole at the top, and three smaller rectangular pieces."
            },
            {
              "step_number": 2,
              "instruction": "Take the back piece of card and from the base, measure and mark with a pencil the following positions - 1/8in, 9/16in and 1in.",
              "technique": "measuring, marking",
              "dimensions_mentioned": [
                "1/8in",
                "9/16in",
                "1in"
              ],
              "visual_description": "Image shows a rectangular piece of card with three horizontal score lines marked from the bottom edge."
            },
            {
              "step_number": 3,
              "instruction": "Take a letter holder and fold the sides down so the scored lines face outwards. Position and glue on to the back piece, so the base of the letter holder rests centrally on a marked line. Repeat the procedure with the remaining card pieces and leave to dry.",
              "technique": "folding, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Image shows three folded card pieces, resembling small boxes, and a larger card piece with score lines. The folded pieces are being glued onto the larger piece."
            },
            {
              "step_number": 4,
              "instruction": "Paint the letter rack with black water-based enamel paint. Decorate the letter holders either by painting or using water-slide transfers soaked off and smoothed on to the front of each one. Highlight the outside edges of the back and holders with gold paste.",
              "technique": "painting, decorating, applying paste",
              "dimensions_mentioned": [],
              "visual_description": "Image shows a finished black letter rack with three compartments, decorated with floral transfers. There are also separate floral transfers shown."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Moulded papier mâché trays were a practical but decorative household item, popular in many Victorian homes. Trays can either be purchased and painted or sprayed with black enamel paint, or made out of card and decorated as described in step 4."
          ],
          "finished_product_description": "A letter rack made from card, painted black and decorated with floral transfers and gold paste highlights."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Letter Rack Templates",
          "scale": null,
          "shape_description": "Templates for a letter rack, consisting of a main back piece and three smaller pieces for the letter holders."
        }
      ],
      "diagram_descriptions": [
        "Image of a finished black papier mâché letter rack with three compartments, decorated with floral designs.",
        "Image of three small floral transfers.",
        "Image of a piece of card with score lines and a hole, and three smaller rectangular pieces for the letter rack.",
        "Image of a rectangular piece of card with three horizontal score lines marked from the bottom edge.",
        "Image showing three folded card pieces being glued onto a larger card piece with score lines.",
        "Image of a finished black letter rack with three compartments, decorated with floral transfers and gold paste highlights."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 48,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A miniature room scene depicting an Edwardian Christmas. A fireplace with a stocking is on the left, and a decorated Christmas tree is on the right. A garland of greenery with pinecones and bows hangs above the fireplace. A paper chain garland is strung across the top of the room. Small wooden toy trains and a sheep figure are on the floor in front of the fireplace and tree. The text 'Edwardian Christmas' is below the scene."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 49,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Coal Box",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "Obecchi sheet wood",
              "quantity": "1/8in thick",
              "dimensions": "1 3/8in x 7 1/8in",
              "purpose": "for base"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "1/8in thick",
              "dimensions": "1 1/8in x 7 1/8in",
              "purpose": "for back"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "2 pieces, 1/16in thick",
              "dimensions": "1 1/8in x 15/16in",
              "purpose": "for front and top"
            },
            {
              "item": "Obecchi sheet wood",
              "quantity": "2 pieces, 1/16in thick",
              "dimensions": "1 1/2in x 1 1/16in",
              "purpose": "for sides"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "1/16in thick",
              "dimensions": "1 1/8in length",
              "purpose": "for front support"
            },
            {
              "item": "Obecchi strip wood",
              "quantity": "2 pieces, 1/16in thick",
              "dimensions": "3/8in lengths",
              "purpose": "for top supports"
            },
            {
              "item": "Wooden double column or small wooden drawer knob"
            },
            {
              "item": "Brass handle"
            },
            {
              "item": "Brass pins",
              "quantity": "2",
              "dimensions": "1/8in length"
            },
            {
              "item": "Gold-plated eye pin"
            },
            {
              "item": "Thin brass sheet",
              "dimensions": "7/8in x 3/8in"
            },
            {
              "item": "20-gauge brass wire",
              "dimensions": "3/4in length"
            },
            {
              "item": "Wooden belaying pin",
              "dimensions": "14mm"
            },
            {
              "item": "Model railway coal"
            },
            {
              "item": "Dark brown shoe polish"
            },
            {
              "item": "Black water-based acrylic paint"
            },
            {
              "item": "Tacky glue"
            },
            {
              "item": "Superglue gel"
            }
          ],
          "tools": [
            {
              "name": "Craft knife",
              "purpose": "cutting",
              "optional": false
            },
            {
              "name": "Ruler",
              "purpose": "measuring and cutting",
              "optional": false
            },
            {
              "name": "Fine-grade sandpaper",
              "purpose": "smoothing edges",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Transfer the coal box side template (page 62) on to the two side pieces of obecchi sheet wood. Use a craft knife and ruler to cut out the shape, then sand any rough edges using fine-grade sandpaper.",
              "visual_description": "Two trapezoidal pieces of light-colored wood, one with a slightly curved top edge."
            },
            {
              "step_number": 2,
              "instruction": "Take the front wood piece and chamfer the edge of one long side to an angle of 60 degrees using fine-grade sandpaper (see Basic Techniques page 12).",
              "visual_description": "A rectangular piece of light-colored wood with one long edge beveled at an angle."
            },
            {
              "step_number": 3,
              "instruction": "Take the double column and cut where shown to make a drawer knob. Sand the knob and the remaining wood pieces smooth using fine-grade sandpaper. Use a dark brown shoe polish to colour all of the wooden components (see page 12).",
              "visual_description": "Several small pieces of light-colored wood. One piece is cylindrical and appears to be a knob. Other pieces are small blocks and a thin strip."
            },
            {
              "step_number": 4,
              "instruction": "Take the side wood pieces and position so they are a mirror image of each other. Transfer the ledge measurements from page 62 on to each piece, then position and glue the two top supports into place.",
              "visual_description": "Two trapezoidal pieces of wood with a wood grain pattern, positioned as mirror images. The top edges are angled."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Due to improvements in transport during the mid 19th century, coal became a cheap and reliable source of domestic fuel. Many homes had a fireplace in each room and fireside accessories were plentiful. This coal box is fitted with a small hook at the back of the box to hold a brass scoop. To avoid using hinges, which can be fiddly and expensive, the lid just slots on to the front of the box."
          ],
          "finished_product_description": "A miniature wooden coal box with a lid and a brass handle."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Coal box side template",
          "scale": null,
          "shape_description": "Trapezoidal shape with one long side angled and the opposite side possibly having a slight curve."
        }
      ],
      "diagram_descriptions": [
        "A miniature wooden coal box with a hinged lid, a small brass handle on the lid, and a hook on the back.",
        "Two identical trapezoidal pieces of light-colored wood, representing the sides of the coal box.",
        "A rectangular piece of light-colored wood with one long edge chamfered at an angle.",
        "Several small pieces of light-colored wood, including a cylindrical piece suitable for a drawer knob, and small blocks.",
        "Two trapezoidal pieces of wood with a visible wood grain pattern, positioned as mirror images, representing the sides of the coal box with angled top edges."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 50,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Coal Box",
          "category": "woodworking",
          "difficulty": "intermediate",
          "materials": [
            {
              "item": "wood piece",
              "quantity": "1",
              "dimensions": "for base",
              "color": "wood"
            },
            {
              "item": "wood pieces",
              "quantity": "2",
              "dimensions": "for sides",
              "color": "wood"
            },
            {
              "item": "wood piece",
              "quantity": "1",
              "dimensions": "for back",
              "color": "wood"
            },
            {
              "item": "brass handle",
              "quantity": "1",
              "dimensions": "small",
              "color": "brass"
            },
            {
              "item": "brass pin",
              "quantity": "1",
              "dimensions": "1/8in long",
              "color": "brass"
            },
            {
              "item": "eye pin",
              "quantity": "1",
              "dimensions": "1/4in long",
              "color": "metal"
            },
            {
              "item": "brass sheet",
              "quantity": "1",
              "dimensions": "for scoop",
              "color": "brass"
            },
            {
              "item": "brass wire",
              "quantity": "1",
              "dimensions": "for scoop handle",
              "color": "brass"
            },
            {
              "item": "wooden knob",
              "quantity": "1",
              "dimensions": "small",
              "color": "wood"
            }
          ],
          "tools": [
            {
              "name": "mitre cutters",
              "purpose": "cutting",
              "optional": false
            },
            {
              "name": "drill bit",
              "purpose": "drilling holes",
              "optional": false
            },
            {
              "name": "pliers",
              "purpose": "bending",
              "optional": false
            },
            {
              "name": "superglue gel",
              "purpose": "adhering",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 5,
              "instruction": "Take the base wood piece and mark 1/8in from one short side edge. Position and glue the front support on the line so there is a 1/8in gap between the outside edge of the base and the front support.",
              "technique": "marking and gluing",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "A rectangular wooden piece with a smaller rectangular piece glued to one short edge, leaving a 1/8in gap."
            },
            {
              "step_number": 6,
              "instruction": "Position the base as shown. Place the two sides beside the base (ledges facing), together with the back wood piece and glue the three pieces on to the outside edges of the base.",
              "technique": "assembly and gluing",
              "dimensions_mentioned": [],
              "visual_description": "The base piece with two side pieces and a back piece glued to its outer edges, forming an open box."
            },
            {
              "step_number": 7,
              "instruction": "Fix the brass handle centrally on to the top wood piece by inserting one 1/8in long brass pin into each hole at the side of the handle through into the wood. Glue the construction on top of the coal box.",
              "technique": "attaching hardware",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "A small brass handle attached to a wooden piece with brass pins. This piece is shown being glued on top of the assembled coal box."
            },
            {
              "step_number": 8,
              "instruction": "Take the front wood piece and position it so the chamfered edge faces forwards and downwards. Mark 1/8in from the front long edge and centrally position and glue the wooden knob into place. Once dry, check it slots into the front of the box.",
              "technique": "attaching hardware",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "A wooden knob is being glued to a wooden piece with a chamfered edge. This piece is intended to fit into the front of the coal box."
            },
            {
              "step_number": 9,
              "instruction": "To make the hook at the back of the box, cut an eye pin to measure 1/4in long and use pliers to slightly open the eye of the pin. Mark 1/8in down from the back of the coal box and drill a hole centrally using a 1/32in drill bit and glue the eye pin into place.",
              "technique": "making hardware",
              "dimensions_mentioned": [
                "1/4in",
                "1/8in",
                "1/32in"
              ],
              "visual_description": "An eye pin is being prepared and then inserted into a hole drilled in the back of the coal box."
            },
            {
              "step_number": 10,
              "instruction": "To make the scoop, fold the brass sheet in half. Trim the side edges to a slight angle as shown. Make a hole in the top of the folded sheet using a 1/32in drill bit. Take the length of brass wire and secure the end into the hole using superglue gel. Once dry, curve the sides into the shape of a scoop.",
              "technique": "making a scoop",
              "dimensions_mentioned": [
                "1/32in"
              ],
              "visual_description": "A brass sheet is folded, trimmed, and a hole is drilled. A brass wire is inserted into the hole to form the handle of a scoop."
            },
            {
              "step_number": 11,
              "instruction": "To make the handle for the scoop, remove the straight end from the belaying pin using mitre cutters. Use a 1/32in drill bit and drill a hole into the flat end of the pin. Dab the end of the wire with superglue gel and insert it into the pin handle.",
              "technique": "making a handle",
              "dimensions_mentioned": [
                "1/32in"
              ],
              "visual_description": "A belaying pin is cut and drilled. The wire handle of the scoop is inserted into the drilled end of the belaying pin."
            },
            {
              "step_number": 12,
              "instruction": "When the scoop is not in use, insert the brass rod into the hook at the back of the box. Traditionally, coal boxes were lined with metal but this is not included in this project. Instead, dry brush the inside with black acrylic paint and when dry, fill with coal.",
              "technique": "finishing and filling",
              "dimensions_mentioned": [],
              "visual_description": "The finished coal box with the scoop inserted into the hook. The inside of the box is shown filled with model coal."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "An alternative to the brass sheet used for the handle and coal scoop is the malleable metal of a tomato purée tube which is brass coloured on the inside of the tube. Model railway coal is ideal for filling the coal box."
          ],
          "finished_product_description": "A miniature wooden coal box with a brass handle and a scoop made from brass sheet and wire."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image 5: A single rectangular wooden piece, representing the base of the coal box.",
        "Image 6: The base piece from Image 5 with two side pieces and a back piece glued to its outer edges, forming an open box.",
        "Image 7: A small brass handle and two small brass pins, and a wooden piece to which the handle is attached.",
        "Image 8: A small wooden knob.",
        "Image 9: An eye pin, bent slightly open.",
        "Image 10: A rectangular piece of brass sheet folded in half, and a piece of brass wire.",
        "Image 11: A wooden pin (belaying pin) with a hole drilled in one end.",
        "Image 12: The completed coal box with the scoop attached to the hook at the back. The inside is filled with model coal.",
        "Tip Image: The completed coal box from Image 12, shown from a different angle, filled with model coal."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 51,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Festive Silk Bows",
          "category": "textile",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "wood",
              "quantity": "1 piece",
              "dimensions": "1/4in thick",
              "color": "any"
            },
            {
              "item": "wood",
              "quantity": "1 piece",
              "dimensions": "3in x 2 1/2in approximately",
              "color": "any"
            },
            {
              "item": "hooks",
              "quantity": "2",
              "dimensions": "3/8in",
              "color": "any"
            },
            {
              "item": "silk ribbon",
              "quantity": "for the bows",
              "dimensions": "3mm width",
              "color": "any"
            }
          ],
          "tools": [
            {
              "name": "scissors",
              "purpose": "cutting ribbon",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "To make the bow maker, drill two 1/16in holes into the wooden block so they are in line with each other and 3/8in apart. Screw the hooks into the drilled holes with the openings facing the same way.",
              "technique": "drilling, screwing",
              "dimensions_mentioned": [
                "1/16in",
                "3/8in"
              ],
              "visual_description": "A piece of wood with two screw hooks inserted, openings facing the same direction."
            },
            {
              "step_number": 2,
              "instruction": "Take the silk ribbon and rest it in the openings of the hooks, leaving 2in at one end to work with and the excess at the other end. It doesn't matter how long the excess ribbon is, just work directly from the spool or length of ribbon to avoid wastage.",
              "technique": "ribbon tying",
              "dimensions_mentioned": [
                "2in"
              ],
              "visual_description": "A piece of wood with two hooks, and a red ribbon threaded through the hooks, with ends extending."
            },
            {
              "step_number": 3,
              "instruction": "Cross the ribbon in front of the hooks by bringing the short end over the top of the excess ribbon, so each end changes sides.",
              "technique": "ribbon tying",
              "dimensions_mentioned": [],
              "visual_description": "The red ribbon is crossed in front of the hooks, with the ends switching positions."
            },
            {
              "step_number": 4,
              "instruction": "At this stage you will need a tool like the small pair of scissors shown. Hold the ribbon in one hand and scissors in the other.",
              "technique": "holding",
              "dimensions_mentioned": [],
              "visual_description": "A hand holding a red ribbon and a pair of scissors."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "Depending on the width of the silk ribbon, you can vary the size of the hooks and the distance apart. For 2mm silk ribbon the hooks should be 1/4in apart. For 5mm silk and organdie ribbon they should be 1/2in apart. The same method can be used to make other delicate bows out of threads, string and raffia."
          ],
          "finished_product_description": "Tiny bows made from silk ribbon."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Three small red silk bows arranged in a cluster.",
        "A finished gold mesh bow with long trailing loops.",
        "A small finished gold ribbon bow with short loops.",
        "A simple bow shape made from a single strand of ribbon."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 52,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Christmas Card Ribbon Decoration",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "ribbon",
              "quantity": "1 piece",
              "dimensions": "3mm wide silk",
              "color": "red"
            }
          ],
          "tools": [
            {
              "name": "scissors",
              "purpose": "pushing ribbon through gaps",
              "optional": false
            },
            {
              "name": "scissors",
              "purpose": "trimming ribbon ends",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 5,
              "instruction": "Use the point of the scissors to push the short end piece beneath, through the gap in the hooks and underneath the ribbon which is held in the hook openings.",
              "technique": "inserting",
              "dimensions_mentioned": [],
              "visual_description": "Close-up of scissors pushing a red ribbon under two small gold hooks attached to a beige board."
            },
            {
              "step_number": 6,
              "instruction": "Hold the ribbon and gently pull each end, so each end is flat and vertical in front of you.",
              "technique": "pulling",
              "dimensions_mentioned": [],
              "visual_description": "A piece of beige board with two gold hooks, with a red ribbon threaded through and hanging vertically from the front."
            },
            {
              "step_number": 7,
              "instruction": "Bring the short end piece of ribbon over the top of the ribbon held in the hooks and hold to your left-hand side whilst taking the opposite end to the right-hand side.",
              "technique": "wrapping",
              "dimensions_mentioned": [],
              "visual_description": "A piece of beige board with two gold hooks, with a red ribbon threaded through. One end is brought over the top of the other and held to the left, while the other end is held to the right."
            },
            {
              "step_number": 8,
              "instruction": "Ease the excess ribbon underneath the short end of silk ribbon to form a small loop and hold as shown above.",
              "technique": "forming a loop",
              "dimensions_mentioned": [],
              "visual_description": "A piece of beige board with two gold hooks, with a red ribbon threaded through. A small loop has been formed on the front."
            },
            {
              "step_number": 9,
              "instruction": "Tuck the short end of the ribbon up and through the silk ribbon loop. Pull each end to centralize and tighten the knot in between the two hooks.",
              "technique": "knot tying",
              "dimensions_mentioned": [],
              "visual_description": "A piece of beige board with two gold hooks. The short end of the red ribbon is tucked through the loop and pulled to tighten a knot between the hooks."
            },
            {
              "step_number": 10,
              "instruction": "Slide the bow off the hooks and trim the ribbon ends to an angle and to the length required.",
              "technique": "trimming",
              "dimensions_mentioned": [],
              "visual_description": "A finished red ribbon bow with angled ends, detached from the hooks."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "You could display Edwardian Christmas cards on a length of 3mm wide silk ribbon, topped with a bow. Christmas card catalogues contain tiny modern and antique images which may be used. Some are small enough to be used as they are, while others may need to be reduced on a photocopier."
          ],
          "finished_product_description": "A decorative bow made from red ribbon, attached to a card or other item using hooks."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Step 5: Close-up of scissors pushing a red ribbon under two small gold hooks attached to a beige board.",
        "Step 6: A piece of beige board with two gold hooks, with a red ribbon threaded through and hanging vertically from the front.",
        "Step 7: A piece of beige board with two gold hooks, with a red ribbon threaded through. One end is brought over the top of the other and held to the left, while the other end is held to the right.",
        "Step 8: A piece of beige board with two gold hooks, with a red ribbon threaded through. A small loop has been formed on the front.",
        "Step 9: A piece of beige board with two gold hooks. The short end of the red ribbon is tucked through the loop and pulled to tighten a knot between the hooks.",
        "Step 10: A finished red ribbon bow with angled ends, detached from the hooks.",
        "Tip: A vertical arrangement of small Christmas cards and images, strung on red ribbon and topped with a red bow."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 53,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Stocking and Presents",
          "category": "mixed_media",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Red and cream paper ribbon",
              "quantity": "1 piece",
              "color": "red and cream"
            },
            {
              "item": "White paper for photocopying",
              "quantity": "1 piece",
              "color": "white"
            },
            {
              "item": "Tacky glue",
              "quantity": "1 bottle"
            },
            {
              "item": "Small blocks of wood",
              "quantity": "1 piece",
              "dimensions": "7/8in x 3/8in x 1/8in"
            },
            {
              "item": "Paper ribbon in a variety of colours",
              "quantity": "1 piece",
              "color": "various"
            },
            {
              "item": "Metallic thread",
              "quantity": "1 piece",
              "color": "metallic"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Photocopy and cut out the stocking template on page 62. Place the template on top of a folded piece of red paper ribbon, creases running vertically, and cut to shape. Cut a 1in x 1/16in piece of red ribbon, loop it over and glue it to the top of one of the stocking pieces.",
              "technique": "photocopying, cutting, gluing",
              "dimensions_mentioned": [
                "1in x 1/16in"
              ],
              "visual_description": "Two images showing a red paper stocking cut out from folded paper, and a finished red stocking with a white top."
            },
            {
              "step_number": 2,
              "instruction": "Glue the edges of the two stocking pieces together. Cut four 3/4in x 1/2in pieces of cream paper ribbon and glue on to each side of the stocking as shown. Once dry, trim to shape. Cut a 1 3/4in x 3/16in length of cream paper ribbon and glue around the top of the stocking.",
              "technique": "gluing, trimming",
              "dimensions_mentioned": [
                "3/4in x 1/2in",
                "1 3/4in x 3/16in"
              ],
              "visual_description": "Two images showing a red stocking with cream paper ribbon glued to the sides and top."
            },
            {
              "step_number": 1,
              "instruction": "Cut a piece of paper ribbon to fold around a small rectangular wooden block (creases to run with the longest length of the block) – the block size shown is 7/8in x 3/8in x 1/8in. Trim the sides to the height of the block and then glue the block on to the paper.",
              "technique": "cutting, folding, gluing",
              "dimensions_mentioned": [
                "7/8in x 3/8in x 1/8in"
              ],
              "visual_description": "A green paper-wrapped block with a cream paper ribbon on top."
            },
            {
              "step_number": 2,
              "instruction": "Wrap the paper around the wood, using tacky glue to secure. Crease the side flaps, fold over and glue neatly on to the end of the block. Tie metallic thread around the wrapped parcel to provide the finishing touch.",
              "technique": "wrapping, gluing, tying",
              "dimensions_mentioned": [],
              "visual_description": "Three images showing green paper-wrapped blocks, with one tied with metallic thread."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A handmade Christmas stocking and small wrapped presents."
        }
      ],
      "tools_reference": [],
      "templates": [
        {
          "name": "Stocking template",
          "scale": "1:1",
          "shape_description": "A stocking shape with a separate piece for the cuff."
        }
      ],
      "diagram_descriptions": [
        "A collection of red and green wrapped presents tied with ribbon, and a gold tinsel garland.",
        "A red paper stocking with a white top.",
        "A red paper stocking being cut from folded paper, with a white paper template placed on top.",
        "A finished red paper stocking with cream paper ribbon details on the sides and top.",
        "A small wooden block wrapped in green paper, with a cream paper ribbon on top.",
        "Three small wooden blocks wrapped in green paper, with one tied with metallic thread."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 54,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Paper Chains",
          "category": "paper_craft",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "quilling paper",
              "quantity": "strips",
              "dimensions": "2mm width",
              "color": "selection of colours"
            },
            {
              "item": "hardwood dowel",
              "quantity": "1",
              "dimensions": "1/8in diameter"
            },
            {
              "item": "tacky glue",
              "quantity": "1"
            }
          ],
          "tools": [],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Take a strip of quilling paper and cut it into 5/8in lengths. Repeat with the remaining strips of paper. Wind a strip around the dowel to make the first ring and use a small amount of tacky glue to secure the end.",
              "technique": "cutting, winding, gluing",
              "dimensions_mentioned": [
                "5/8in"
              ],
              "visual_description": "Diagram shows a dowel with a strip of paper wound around it, forming a ring. A second strip is shown being wound around the dowel."
            },
            {
              "step_number": 2,
              "instruction": "Remove the ring from the dowel and thread a different coloured strip of paper into the ring. Rest the dowel next to the previous ring, wind the new strip around the dowel to make the second ring and glue to secure the end. Repeat using the remaining strips to create a long chain.",
              "technique": "threading, winding, gluing",
              "dimensions_mentioned": [],
              "visual_description": "Diagram shows a completed ring threaded onto a new strip of paper, with the dowel positioned next to it. A second ring is shown being formed around the dowel."
            }
          ],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": "A long chain made of interlocking paper rings."
        },
        {
          "name": "Crackers",
          "category": "paper_craft",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "red and gold paper ribbon",
              "quantity": "1 piece",
              "dimensions": "3/4in square"
            },
            {
              "item": "short wood dowel",
              "quantity": "1"
            },
            {
              "item": "hardwood dowel",
              "quantity": "1",
              "dimensions": "1/8in diameter"
            },
            {
              "item": "lengths for cracker centres",
              "quantity": "1/4in"
            },
            {
              "item": "removable cracker forms",
              "quantity": "two 1in lengths"
            },
            {
              "item": "gold-plated jewellery wire",
              "quantity": "1",
              "dimensions": "34-gauge"
            },
            {
              "item": "tacky glue",
              "quantity": "1"
            }
          ],
          "tools": [
            {
              "name": "pliers",
              "purpose": "twisting wires",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Cut a piece of red paper ribbon 3/4in square and glue a short wood dowel piece centrally to the top of the paper (creases running horizontally). Place the forms on either side, roll the paper around all three wood pieces and glue to secure the end of the paper.",
              "technique": "cutting, gluing, rolling",
              "dimensions_mentioned": [
                "3/4in",
                "1/4in"
              ],
              "visual_description": "Diagram shows a square piece of red paper with a short dowel glued to the top center. Two other dowels (forms) are placed on either side, and the paper is being rolled around them."
            },
            {
              "step_number": 2,
              "instruction": "Take a 2in length of wire and position between the dowel centre and a form. Using pliers, twist the wires to gather the paper. Trim off excess wire, remove the form and repeat on the opposite end. Glue a 1/2in x 3/16in piece of gold paper around the centre.",
              "technique": "twisting, trimming, gluing",
              "dimensions_mentioned": [
                "2in",
                "1/2in",
                "3/16in"
              ],
              "visual_description": "Diagram shows a cracker form with wire twisted around the paper at one end. A piece of gold paper is shown being glued around the center."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "You can easily modernize the crackers by decorating them with tiny confetti shapes."
          ],
          "finished_product_description": "Christmas crackers made from red and gold paper ribbon."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Image of several finished crackers, some decorated with stars.",
        "Diagram showing the process of making paper chains, illustrating winding paper strips around dowels to form rings.",
        "Diagram showing the process of making crackers, illustrating rolling paper around dowels and securing with wire."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 55,
    "extracted": {
      "page_type": "project",
      "projects": [
        {
          "name": "Garland",
          "category": "other",
          "difficulty": "beginner",
          "materials": [
            {
              "item": "Evergreen garland or pipe cleaners",
              "quantity": "1 length",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Centre (reed) cane",
              "quantity": "1",
              "dimensions": "size 000, 4in length",
              "color": null
            },
            {
              "item": "34-gauge gold-plated wire",
              "quantity": "1",
              "dimensions": null,
              "color": "gold"
            },
            {
              "item": "Silk ribbon bows",
              "quantity": "2",
              "dimensions": "3mm width",
              "color": null
            },
            {
              "item": "Dried allspice berries",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Coriander seeds",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Black and yellow mustard seeds",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "White peppercorns",
              "quantity": null,
              "dimensions": null,
              "color": "white"
            },
            {
              "item": "Antique pine and light oak water-based wood stain",
              "quantity": "mix of",
              "dimensions": null,
              "color": null
            },
            {
              "item": "Tacky glue",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [
            {
              "name": "Wire cutters",
              "purpose": "cutting garland or pipe cleaner",
              "optional": false
            }
          ],
          "steps": [
            {
              "step_number": 1,
              "instruction": "Use wire cutters to cut a length of evergreen garland or pipe cleaner approximately 7in long. Bend into the shape shown in the photograph above.",
              "technique": "cutting, bending",
              "dimensions_mentioned": [
                "7in"
              ],
              "visual_description": "A length of evergreen garland bent into a wavy shape."
            },
            {
              "step_number": 2,
              "instruction": "Take another length of evergreen and wind around the garland shape to thicken it. This may need to be repeated depending on the original thickness of the evergreen garland/pipe cleaners.",
              "technique": "winding",
              "dimensions_mentioned": [],
              "visual_description": "A second length of evergreen garland being wound around the first to thicken it."
            },
            {
              "step_number": 3,
              "instruction": "To make cinnamon sticks, take the centre cane and soak in warm water for a few minutes, then pull straight, weigh down each end and leave to dry. Stain with a mix of antique pine and light oak wood stain and once dry cut into 3/8in lengths.",
              "technique": "soaking, drying, staining, cutting",
              "dimensions_mentioned": [
                "3/8in"
              ],
              "visual_description": "A cane being soaked, then pulled straight and weighed down to dry, followed by stained pieces cut into short lengths."
            },
            {
              "step_number": 4,
              "instruction": "Take three cinnamon sticks and bundle together, winding wire around the centre to hold in place. Trim the end of the wire leaving 1/8in protruding for securing into the garland. Decorate the garland with the sticks, seeds, peppercorns, dried berries and bows.",
              "technique": "bundling, winding, trimming, decorating",
              "dimensions_mentioned": [
                "1/8in"
              ],
              "visual_description": "Three cinnamon sticks bundled together with wire, and a close-up of various decorative elements like seeds and peppercorns."
            }
          ],
          "blueprint_data": null,
          "tips": [
            "See instructions on page 54 for ribbon bows."
          ],
          "finished_product_description": "A festive garland made from evergreen branches, decorated with cinnamon sticks, berries, seeds, and bows."
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A long, curved garland made of evergreen branches, decorated with small red bows, brown seed-like objects, and short white sticks.",
        "A shorter, wavy garland made of evergreen branches.",
        "A longer, more elaborate garland made of evergreen branches, bent into a shape with two downward-hanging ends.",
        "A circular wreath made of evergreen branches, decorated with short sticks, brown seed-like objects, and a red bow in the center.",
        "A diagram showing a curved piece of wire, and two short straight pieces of wire.",
        "A collection of decorative elements including short sticks, brown seed-like objects, and small white round objects."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 56,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [
        {
          "name": "Silhouettes",
          "scale": null,
          "shape_description": "Multiple black silhouette profiles of human heads and shoulders, varying in size and style."
        },
        {
          "name": "Framed Photographs",
          "scale": null,
          "shape_description": "Multiple small, rectangular photographs depicting people in various settings and poses."
        },
        {
          "name": "Leather Mug Template",
          "scale": null,
          "shape_description": "A rectangular shape with dimensions labeled. Also includes a circular shape with a diameter labeled."
        },
        {
          "name": "Leather Bucket Template",
          "scale": null,
          "shape_description": "A curved, fan-like shape with two small dots indicating placement points."
        },
        {
          "name": "Aspidistra - Leaf Shape",
          "scale": null,
          "shape_description": "An elongated oval shape with pointed ends, representing a leaf."
        },
        {
          "name": "Spider Plant - Leaf Shape",
          "scale": null,
          "shape_description": "A long, thin, and narrow shape with pointed ends, representing a leaf."
        }
      ],
      "diagram_descriptions": [
        "A circular diagram with a diameter of 5/8in.",
        "A curved template labeled 'Leather Bucket'.",
        "A rectangular template labeled 'Leather Mug' with dimensions 1 7/8in and 1/2in.",
        "A thin rectangular template with dimensions 1/16in and 1/2in.",
        "A circular diagram with a diameter of 3/8in."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 57,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "Diagram of a side table base, a rectangle with dimensions 2 1/4in x 2in, with various smaller dimensions indicated for notches and thickness.",
        "Diagram of a papier-mâché letter rack back, a rectangular shape with a rounded top, dimensions 1 3/4in x 1 1/8in, with a hole at the top.",
        "Diagram of a coat and hat rack, a rectangular bar with dimensions 2 1/2in x 3/8in, with four evenly spaced dots representing attachment points.",
        "Diagram of a coat and hat rack variation, a rectangular bar with dimensions 2in x 3/8in, with three evenly spaced dots.",
        "Diagram of a coat and hat rack side piece, a right-angled triangle with dimensions 1in x 1in, with 'x 2' indicating two pieces.",
        "Diagram of a stick stand base, a rectangular shape with rounded corners, dimensions 1 3/4in x 7/8in, with various smaller dimensions indicating notches and thickness.",
        "Diagram of a papier-mâché letter rack holder, a trapezoidal shape with dimensions 1in x 5/16in, with 'x 3' indicating three pieces.",
        "Diagram of a box-seat settle arm rest, a curved shape resembling a question mark, labeled 'Back' and 'Front'.",
        "Diagram of a stick stand variation base, a rectangular shape with rounded corners, dimensions 7/8in x 7/8in, with various smaller dimensions indicating notches and thickness.",
        "Diagram of a Christmas stocking outline.",
        "Diagram of two spear shapes, each with a pointed top and a rectangular base.",
        "Diagram of a bracket lamp shape, a curved line with 'Back' and 'Front' labels.",
        "Diagram of a decoy duck outline, a simple silhouette.",
        "Diagram of a side chair back, a rectangular frame with two horizontal slats and two vertical supports, overall dimensions 2 3/4in x 2 7/8in.",
        "Diagram of a fighting axe head, a symmetrical shape with two curved blades and a central rectangular haft.",
        "Diagram of a coal box side piece, a trapezoidal shape with dimensions 1 1/2in x 1 1/16in, with 'x 2' indicating two pieces.",
        "Diagram of a side chair front, a rectangular frame with one horizontal slat and two vertical supports, overall dimensions 1 3/8in x 2 7/8in.",
        "Diagram of two coal box ledge position pieces, each a trapezoidal shape with a horizontal bar at the top, dimensions 1 1/16in x 13/16in."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 58,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A basket filled with logs and branches."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 59,
    "extracted": {
      "page_type": "other",
      "projects": [],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  },
  {
    "page_number": 60,
    "extracted": {
      "page_type": "introduction",
      "projects": [
        {
          "name": "Tudor Times",
          "category": "other",
          "difficulty": null,
          "materials": [
            {
              "item": "wooden stool",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "torchiere",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "fighting axe",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "leather bucket",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "box-seat settle",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": null
        },
        {
          "name": "Classical Style",
          "category": "other",
          "difficulty": null,
          "materials": [
            {
              "item": "console table",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "neo-classical mirror",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "decorative pedestals",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "ornamental mask",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "neo-classical vase",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "topiary trees",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "silhouette pictures",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": null
        },
        {
          "name": "Country Style",
          "category": "other",
          "difficulty": null,
          "materials": [
            {
              "item": "side table",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "side chair",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "wall shelves",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "rows and piles of books",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "log basket",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "ceramic plates",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "candlesticks",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "snuffer",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "decoy duck",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": null
        },
        {
          "name": "Victorian Values",
          "category": "other",
          "difficulty": null,
          "materials": [
            {
              "item": "coat and hat rack",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "straw boater",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "walking sticks",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "stick stand",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "plant",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "aspidistra",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "trinkets",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "framed photographs",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "bracket",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "lamps",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "table lamps",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "papier mâché letter rack",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": null
        },
        {
          "name": "Edwardian Christmas",
          "category": "other",
          "difficulty": null,
          "materials": [
            {
              "item": "festive silk bows",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "coal box",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "fairy tree decorations",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "Christmas stocking",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "presents",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "home-made decorations",
              "quantity": null,
              "dimensions": null,
              "color": null
            },
            {
              "item": "evergreen garland",
              "quantity": null,
              "dimensions": null,
              "color": null
            }
          ],
          "tools": [],
          "steps": [],
          "blueprint_data": null,
          "tips": [],
          "finished_product_description": null
        }
      ],
      "tools_reference": [],
      "templates": [],
      "diagram_descriptions": [
        "A collection of book covers for 'Dolls House Do-It-Yourself' series: 'Carpets and Rugs', 'Food Displays', 'Embroidered Projects', 'Toys and Games', and 'Curtains'. Each cover shows a miniature scene or items related to the book's topic.",
        "A large, decorated Christmas tree with tinsel, ornaments, and a star topper. Several small Christmas crackers are placed around the base of the tree.",
        "A rustic wooden armchair with a high back and simple design.",
        "A small, light-colored stone pedestal with a cherubic figure on top.",
        "A small, dark wooden box with an open top, filled with dark material, possibly coal.",
        "Three framed pictures on a white wall. The left picture is small and contains a portrait of two people. The middle picture is larger and contains a portrait of a family. The right picture is medium-sized and contains a portrait of a man.",
        "A barcode with the number 9780715317945 below it.",
        "A barcode with the number 06488416919 below it."
      ],
      "continuation_of_previous": false,
      "project_name_if_continuation": null
    }
  }
]